{
  "url": "https://www.bbc.com/news/articles/cx2gy3j9xq6o",
  "timestamp": "2025-08-18T22:57:12.301619",
  "extracted": {
    "results": [
      {
        "url": "https://www.bbc.com/news/articles/cx2gy3j9xq6o",
        "raw_content": "[Skip to content](#main-content)\n\n[Watch Live](/watch-live-news/)\n\nAdvertisement\n\n# Linda Yaccarino departs as boss of Musk's X\n\nGraham Fraser, Zoe Kleinman, and Lily Jamali\n\nBBC News\n\nLinda Yaccarino, the boss of Elon Musk's social media site X, has announced she is stepping down after two years.\n\nHer departure comes at a time of tumult for the platform, which was taken over by Musk's artificial intelligence (AI) venture, xAI, in March, and has been in the spotlight for antisemitic posts churned out by its AI chatbot, Grok.\n\nIn a post on [X](https://x.com/lindayaX/status/1942957094811951197), Ms Yaccarino said she was \"immensely grateful\" to Musk for \"entrusting me with the responsibility of protecting free speech, turning the company around, and transforming X into the Everything App\".\n\nMusk posted a brief reply, saying only: \"Thank you for your contributions.\"\n\nThe BBC has approached X for comment. It is not clear what sparked the decision, or whether there has been any break down in the relationship between the two leaders.\n\nMs Yaccarino was previously head of advertising at NBCUniversal, where she was credited with helping to steer it through the upheaval caused by technology firms.\n\nWhen Musk brought her in to lead X, then Twitter, in 2023, analysts expected her focus to be repairing relationships with advertisers, which had quit the site amid concerns about their ads appearing alongside controversial content.\n\nBut Ms Yaccarino's scope at the company was limited from the start, with many observers referring to her as chief executive in name only.\n\n\"Her background and actual authority positioned her more as the company's chief advertising officer, rather than its CEO. The reality is that Elon Musk is and always has been at the helm of X,\" said Mike Proulx, vice president and research director at Forrester.\n\n\"The only thing that's surprising about Linda Yaccarino's resignation is that it didn't come sooner,\" he added.\n\n## Advertising turnaround?\n\nUnder Ms Yaccarino's watch, the company sued a major advertising industry group and members, alleging a conspiracy to boycott X.\n\nThe industry group shuttered shortly after the lawsuit was filed.\n\nThe platform's tone changed significantly during the course of Yaccarino's tenure.\n\nIts former incarnation Twitter was accused of leaning left, but X now leans unashamedly to the right in terms of the content that gets the most visibility.\n\nThough Musk stepped down as chief executive, he never truly stepped back from his favourite social network, and has if anything grown louder and more controversial since he appointed her.\n\nPeople who have worked directly with Musk have described him as both a visionary and a workaholic, whom others can only keep up with for so long.\n\n\"Faced with a mercurial owner who never fully stepped away from the helm and continued to use the platform as his personal megaphone, Yaccarino had to try to run the business while also regularly putting out fires,\" Emarketer vice president Jasmine Enberg said in a statement.\n\nShe said her firm expected X's ad business to return to growth this year, after more than halving after Musk's takeover.\n\nBut she added: \"The reasons for X's ad recovery are complicated, and Yaccarino was unable to restore the platform's reputation among advertisers.\"\n\nIn Ms Yaccarino's departure post, she said that she had decided to step down after \"two incredible years\".\n\nShe added: \"When Elon Musk and I first spoke of his vision for X, I knew it would be the opportunity of a lifetime to carry out the extraordinary mission of this company.\"\n\nMs Yaccarino's exit comes at a difficult time for Musk, who is dealing with falling sales at his car maker Tesla, which has also seen the departure of a number of top executives.\n\nHe is also embroiled in a war of words with his former political ally, US President Donald Trump, culminating in Musk [planning a new political party](https://www.bbc.co.uk/news/articles/cy4n09lpz41o).\n\nX has also continued to attract controversy.\n\nThe most recent of these has seen Musk's chatbot, Grok - which is embedded in X - [speak favourably about Hitler](https://www.bbc.co.uk/news/articles/c4g8r34nxeno) among other antisemitic posts early this week.\n\nMusk on Friday had said the company had been working to overhaul Grok and that users \"should notice a difference\" when asking Grok questions.\n\nIn instructions posted publicly by the company, Grok was directed to \"[a]ssume subjective viewpoints sourced from the media are biased\" and to \"not shy away from making claims which are politically incorrect.\"\n\nIn a statement, xAI said it was working to remove what it called \"inappropriate\" posts.\n\n[## Linda Yaccarino replaces Elon Musk as Twitter boss](https://www.bbc.co.uk/news/business-65806686)\n\n[## Who is Linda Yaccarino, Twitter's 'superwoman'?](https://www.bbc.co.uk/news/business-65640622)\n\n[Sign up for our Tech Decoded newsletter](https://www.bbc.co.uk/newsletters/zxh6cxs) to follow the world's top tech stories and trends. [Outside the UK? Sign up here](https://cloud.email.bbc.com/techdecoded-newsletter-signup).\n\n\n\n---",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.0,
    "request_id": "e10bd81e-5379-4756-9f0f-b609e0604be2"
  }
}