{
  "url": "https://www.britannica.com/topic/United-Nations",
  "timestamp": "2025-08-18T22:57:53.486404",
  "extracted": {
    "results": [
      {
        "url": "https://www.britannica.com/topic/United-Nations",
        "raw_content": "[SUBSCRIBE](https://premium.britannica.com/premium-membership/?utm_source=premium&utm_medium=hamburger-menu&utm_campaign=evergreen)\n\n[Ask the Chatbot](/chatbot) [Games & Quizzes](/quiz/browse) [History & Society](/History-Society) [Science & Tech](/Science-Tech) [Biographies](/Biographies) [Animals & Nature](/Animals-Nature) [Geography & Travel](/Geography-Travel) [Arts & Culture](/Arts-Culture) [ProCon](/procon) [Money](/money) [Videos](/videos)\n\n# United Nations\n\ninternational organization\n\nAlso known as: UN\n\nWritten by\n\n[Karen Mingst\n\nProfessor Emeritus of Political Science, University of Kentucky, Lexington. Author of *Essentials of International Relations.* Coauthor of *The United Nations in the Post-Cold War Era*.](/contributor/Karen-Mingst/5418)\n\nKaren Mingst\n,\n\n[Jacques Fomerand\n\nDirector, United Nations University, New York. Coauthor of *Higher Education in Western Europe and North America: A Selected and Annotated Bibliography*.](/contributor/Jacques-Fomerand/5568)\n\nJacques Fomerand\n•[All](https://www.britannica.com/topic/United-Nations/additional-info#contributors)\n\nFact-checked by\n\n[The Editors of Encyclopaedia Britannica\n\nEncyclopaedia Britannica's editors oversee subject areas in which they have extensive knowledge, whether from years of experience gained by working on that content or via study for an advanced degree. They write new content and verify and edit content received from contributors.](/editor/The-Editors-of-Encyclopaedia-Britannica/4419)\n\nThe Editors of Encyclopaedia Britannica\n\nLast Updated:\n•\n[Article History](https://www.britannica.com/topic/United-Nations/additional-info#history)\n\nQuick Facts\n\nAwards And Honors:\n:   [Nobel Prize](/topic/Nobel-Prize)\n\nDate:\n:   October 24, 1945 - present\n\nHeadquarters:\n:   [New York City](/place/New-York-City)\n\nAreas Of Involvement:\n:   [human rights](/topic/human-rights)\n:   [trust territory](/topic/trust-territory)\n:   [economic development](/money/economic-development)\n:   [international relations](/topic/international-relations)\n:   [equality](/topic/equality-human-rights)\n\nRelated People:\n:   [Douglas Richard Hurd](/biography/Douglas-Richard-Hurd)\n:   [Franklin D. Roosevelt](/biography/Franklin-D-Roosevelt)\n:   [Benjamin Netanyahu](/biography/Benjamin-Netanyahu)\n:   [George H.W. Bush](/biography/George-H-W-Bush)\n:   [Fridtjof Nansen](/biography/Fridtjof-Nansen)\n\n[See all related content](/facts/United-Nations)\n\nTop Questions\n\n* What is the United Nations?\n* When was the United Nations founded and why?\n* What are the main purposes of the United Nations?\n* How many member countries are there in the United Nations?\n* What are the main organs of the United Nations and their functions?\n* How does the United Nations help maintain international peace and security?\n\n## News •\n\n[Israeli strikes kill journalists and aid-seekers as Australia backs Palestinian statehood](/news/616264/14103d37328c4c9edd562fa0b42e28d7)\n\n• Aug. 11, 2025, 9:36 PM ET (AP)\n\n[Sudan's Rapid Support Forces kill 40 people in North Darfur displacement camp attack](/news/616264/6363c206aa5844002c812af99c656f24)\n\n• Aug. 11, 2025, 6:48 PM ET (AP)\n\n[China and the US clash at the UN over the Panama Canal, a focus of Trump's attention](/news/616264/2aafbbfb0d5fdb27ce04c54a0204a10a)\n\n• Aug. 11, 2025, 6:10 PM ET (AP)\n\n[Israel targets and kills Al Jazeera correspondent Anas al-Sharif in Gaza as journalist toll grows](/news/616264/c7d73f1d3cfa3d24fb4ce5a294c08d32)\n\n• Aug. 11, 2025, 2:00 PM ET (AP)\n\n[Artist drowns sculpture in plastic waste in front of the UN during plastic pollution treaty talks](/news/616264/3ddd2e98fa2e5fec19ed817f8573af0d)\n\n• Aug. 11, 2025, 8:03 AM ET (AP)\n\n**United Nations (UN)**, [international organization](https://www.britannica.com/topic/international-organization) established on October 24, 1945. The United Nations (UN) was the second multipurpose international organization established in the 20th century that was worldwide in scope and membership. Its predecessor, the [League of Nations](https://www.britannica.com/topic/League-of-Nations), was created by the [Treaty of Versailles](https://www.britannica.com/event/Treaty-of-Versailles-1919) in 1919 and disbanded in 1946. Headquartered in [New York City](https://www.britannica.com/place/New-York-City), the UN also has regional offices in [Geneva](https://www.britannica.com/place/Geneva-Switzerland), [Vienna](https://www.britannica.com/place/Vienna), and [Nairobi](https://www.britannica.com/place/Nairobi). Its official languages are [Arabic](https://www.britannica.com/topic/Arabic-language), [Chinese](https://www.britannica.com/topic/Chinese-languages), [English](https://www.britannica.com/topic/English-language), [French](https://www.britannica.com/topic/French-language), [Russian](https://www.britannica.com/topic/Russian-language), and [Spanish](https://www.britannica.com/topic/Spanish-language). For a list of UN member countries and secretaries-general, [*see below*](https://www.britannica.com/topic/United-Nations/Assessment#ref274899).\n\n*[(Read Ted Turner’s Britannica entry on the U.N. Foundation.)](https://www.britannica.com/topic/United-Nations-Foundation)*\n\nAccording to its [Charter](https://www.britannica.com/topic/Charter-of-the-United-Nations), the UN aims:\n\n> to save succeeding generations from the scourge of war,…to reaffirm faith in fundamental human rights,…to establish conditions under which [justice](https://www.merriam-webster.com/dictionary/justice) and respect for the obligations arising from treaties and other sources of [international law](https://www.britannica.com/topic/international-law) can be maintained, and to promote social progress and better standards of life in larger freedom.\n\nIn addition to maintaining peace and security, other important objectives include developing friendly relations among countries based on respect for the principles of [equal rights](https://www.britannica.com/topic/equality-human-rights) and self-determination of peoples; achieving worldwide cooperation to solve international economic, social, cultural, and humanitarian problems; respecting and promoting [human rights](https://www.britannica.com/topic/human-rights); and serving as a centre where countries can coordinate their actions and activities toward these various ends.\n\n[Britannica Quiz\n\n43 Questions About Politics (Mostly in the United States) Compiled from Britannica’s Quizzes](/quiz/43-questions-about-politics-law-and-government-compiled-from-britannicas-quizzes)\n\nThe UN formed a [continuum](https://www.merriam-webster.com/dictionary/continuum) with the League of Nations in general purpose, structure, and functions; many of the UN’s principal organs and related agencies were adopted from similar structures established earlier in the century. In some respects, however, the UN [constituted](https://www.merriam-webster.com/dictionary/constituted) a very different organization, especially with regard to its objective of maintaining international peace and security and its commitment to economic and social development.\n\nChanges in the nature of [international relations](https://www.britannica.com/topic/international-relations) resulted in modifications in the responsibilities of the UN and its decision-making apparatus. [Cold War](https://www.britannica.com/event/Cold-War) tensions between the [United States](https://www.britannica.com/place/United-States) and the [Soviet Union](https://www.britannica.com/place/Soviet-Union) deeply affected the UN’s security functions during its first 45 years. Extensive post-[World War II](https://www.britannica.com/event/World-War-II) [decolonization](https://www.britannica.com/topic/decolonization) in Africa, Asia, and the [Middle East](https://www.britannica.com/place/Middle-East) increased the volume and nature of political, economic, and social issues that confronted the organization. The Cold War’s end in 1991 brought renewed attention and appeals to the UN. Amid an increasingly volatile geopolitical climate, there were new challenges to established practices and functions, especially in the areas of conflict resolution and humanitarian assistance. At the beginning of the 21st century, the UN and its programs and [affiliated](https://www.merriam-webster.com/dictionary/affiliated) agencies struggled to address humanitarian crises and civil wars, unprecedented [refugee](https://www.britannica.com/topic/refugee) flows, the devastation caused by the spread of [AIDS](https://www.britannica.com/science/AIDS), global financial disruptions, international [terrorism](https://www.britannica.com/topic/terrorism), and the disparities in wealth between the world’s richest and poorest peoples.\n\nAccess for the whole family!\n\nBundle Britannica Premium and Kids for the ultimate resource destination.\n\n[Subscribe](https://premium.britannica.com/family-bundle/?utm_source=premium&utm_medium=inline-cta&utm_campaign=family-bundle)\n\n## History and development\n\nDespite the problems encountered by the [League of Nations](https://www.britannica.com/topic/League-of-Nations) in arbitrating conflict and ensuring international peace and security prior to World War II, the major [Allied powers](https://www.britannica.com/topic/Allied-powers-World-War-II) agreed during the war to establish a new global organization to help manage international affairs. This agreement was first [articulated](https://www.merriam-webster.com/dictionary/articulated) when U.S. President [Franklin D. Roosevelt](https://www.britannica.com/biography/Franklin-D-Roosevelt) and British Prime Minister [Winston Churchill](https://www.britannica.com/biography/Winston-Churchill) signed the [Atlantic Charter](https://www.britannica.com/event/Atlantic-Charter) in August 1941. The name United Nations was originally used to denote the countries allied against [Germany](https://www.britannica.com/place/Germany), [Italy](https://www.britannica.com/place/Italy), and [Japan](https://www.britannica.com/place/Japan). On January 1, 1942, 26 countries signed the [Declaration by United Nations](https://www.britannica.com/topic/Declaration-of-United-Nations), which set forth the war aims of the Allied powers.\n\n \n\nThe [United States](https://www.britannica.com/place/United-States), the [United Kingdom](https://www.britannica.com/place/United-Kingdom), and the [Soviet Union](https://www.britannica.com/place/Soviet-Union) took the lead in designing the new organization and determining its decision-making structure and functions. Initially, the “Big Three” states and their respective leaders (Roosevelt, Churchill, and Soviet premier [Joseph Stalin](https://www.britannica.com/biography/Joseph-Stalin)) were hindered by disagreements on issues that foreshadowed the [Cold War](https://www.britannica.com/event/Cold-War). The Soviet Union demanded individual membership and [voting rights](https://www.britannica.com/topic/voting-rights) for its [constituent](https://www.merriam-webster.com/dictionary/constituent) republics, and [Britain](https://www.britannica.com/place/United-Kingdom) wanted [assurances](https://www.merriam-webster.com/dictionary/assurances) that its colonies would not be placed under UN control. There also was disagreement over the voting system to be adopted in the [Security Council](https://www.britannica.com/topic/United-Nations-Security-Council), an issue that became famous as the “veto problem.”\n\n \n\nThe first major step toward the formation of the United Nations was taken August 21–October 7, 1944, at the [Dumbarton Oaks Conference](https://www.britannica.com/event/Dumbarton-Oaks-Conference), a meeting of the diplomatic experts of the Big Three powers plus [China](https://www.britannica.com/place/China) (a group often designated the “Big Four”) held at [Dumbarton Oaks](https://www.britannica.com/place/Dumbarton-Oaks), an estate in [Washington, D.C.](https://www.britannica.com/place/Washington-DC) Although the four countries agreed on the general purpose, structure, and function of a new world organization, the conference ended amid continuing disagreement over membership and voting. At the [Yalta Conference](https://www.britannica.com/event/Yalta-Conference), a meeting of the Big Three in a Crimean resort city in February 1945, Roosevelt, Churchill, and Stalin laid the basis for charter provisions delimiting the authority of the Security Council. Moreover, they reached a tentative accord on the number of Soviet republics to be granted independent memberships in the UN. Finally, the three leaders agreed that the new organization would include a [trusteeship system](https://www.britannica.com/topic/trusteeship-system) to succeed the League of Nations [mandate](https://www.britannica.com/topic/mandate-League-of-Nations) system.\n\n \n\nThe Dumbarton Oaks proposals, with modifications from the Yalta Conference, formed the basis of negotiations at the [United Nations Conference on International Organization](https://www.britannica.com/event/San-Francisco-Conference) (UNCIO), which [convened](https://www.merriam-webster.com/dictionary/convened) in [San Francisco](https://www.britannica.com/place/San-Francisco-California) on April 25, 1945, and produced the final Charter of the United Nations. The San Francisco conference was attended by representatives of 50 countries from all geographic areas of the world: 9 from Europe, 21 from the Americas, 7 from the Middle East, 2 from [East Asia](https://www.britannica.com/place/East-Asia), and 3 from Africa, as well as 1 each from the Ukrainian Soviet Socialist Republic and the Belorussian Soviet Socialist Republic (in addition to the Soviet Union itself) and 5 from British [Commonwealth](https://www.britannica.com/topic/Commonwealth-association-of-states) countries. [Poland](https://www.britannica.com/place/Poland), which was not present at the conference, was permitted to become an original member of the UN. Security Council [veto](https://www.britannica.com/topic/veto) power (among the permanent members) was affirmed, though any member of the General Assembly was able to raise issues for discussion. Other political issues resolved by compromise were the role of the organization in the promotion of economic and social welfare; the status of colonial areas and the distribution of trusteeships; the status of regional and defense arrangements; and Great Power dominance versus the equality of states. The UN Charter was unanimously adopted and signed on June 26 and [promulgated](https://www.merriam-webster.com/dictionary/promulgated) on October 24, 1945.\n\n# Organization and administration\n\n## Principles and membership\n\nThe purposes, principles, and organization of the United Nations are outlined in the Charter. The essential principles underlying the purposes and functions of the organization are listed in Article 2 and include the following: the UN is based on the [sovereign](https://www.merriam-webster.com/dictionary/sovereign) [equality](https://www.britannica.com/topic/equality-human-rights) of its members; disputes are to be settled by peaceful means; members are to refrain from the threat or use of force in contravention of the purposes of the UN; each member must assist the organization in any enforcement actions it takes under the Charter; and states that are not members of the organization are required to act in accordance with these principles insofar as it is necessary to maintain international peace and security. Article 2 also [stipulates](https://www.britannica.com/dictionary/stipulates) a basic long-standing norm that the organization shall not intervene in matters considered within the domestic jurisdiction of any state. Although this was a major limitation on UN action, over time the line between international and domestic jurisdiction has become blurred.\n\n \n\nNew members are admitted to the UN on the recommendation of the Security Council and by a two-thirds vote of the General Assembly. Often, however, the admittance of new members has engendered controversy. Given [Cold War](https://www.britannica.com/event/Cold-War) divisions between East and West, the requirement that the Security Council’s five permanent members (sometimes known collectively as the P-5)—China, [France](https://www.britannica.com/place/France), the [Soviet Union](https://www.britannica.com/place/Soviet-Union) (whose seat and membership were assumed by [Russia](https://www.britannica.com/place/Russia) in 1991), the [United Kingdom](https://www.britannica.com/place/United-Kingdom), and the [United States](https://www.britannica.com/place/United-States)—concur on the admission of new members at times posed serious obstacles. By 1950 only 9 of 31 applicants had been admitted to the organization. In 1955 the 10th Assembly proposed a package deal that, after modification by the Security Council, resulted in the admission of 16 new states (4 eastern European communist states and 12 noncommunist countries). The most [contentious](https://www.merriam-webster.com/dictionary/contentious) application for membership was that of the communist [People’s Republic of China](https://www.britannica.com/place/China), which was placed before the General Assembly and blocked by the United States at every session from 1950 to 1971. Finally, in 1971, in an effort to improve its relationship with mainland China, the United States refrained from blocking the Assembly’s vote to admit the People’s Republic and to expel the Republic of China ([Taiwan](https://www.britannica.com/place/Taiwan)); there were 76 votes in favour of expulsion, 35 votes opposed, and 17 abstentions. As a result, the Republic of China’s membership and permanent Security Council seat were given to the People’s Republic.\n\n \n\nControversy also arose over the issue of “divided” states, including the [Federal Republic of Germany](https://www.britannica.com/place/Germany) (West Germany) and the [German Democratic Republic](https://www.britannica.com/place/East-Germany) (East Germany), North and [South Korea](https://www.britannica.com/place/South-Korea), and North and South Vietnam. The two German states were admitted as members in 1973; these two seats were reduced to one after the country’s reunification in October 1990. [Vietnam](https://www.britannica.com/place/Vietnam) was admitted in 1977, after the defeat of South Vietnam and the reunification of the country in 1975. The two Koreas were admitted separately in 1991.\n\n \n\nFollowing worldwide [decolonization](https://www.britannica.com/topic/decolonization) from 1955 to 1960, 40 new members were admitted, and by the end of the 1970s there were about 150 members of the UN. Another significant increase occurred after 1989–90, when many former Soviet republics gained their independence. By the early 21st century the UN [comprised](https://www.merriam-webster.com/dictionary/comprised) nearly 190 member states.\n\nFeedback\n\nThank you for your feedback\n\nOur editors will review what you’ve submitted and determine whether to revise the article.\n\n*print*\nPrint\n\nPlease select which sections you would like to print:\n\n*verified*Cite\n\nWhile every effort has been made to follow citation style rules, there may be some discrepancies.\nPlease refer to the appropriate style manual or other sources if you have any questions.\n\nSelect Citation Style\n\nMingst, Karen, Fomerand, Jacques, Lynch, Cecelia M.. \"United Nations\". *Encyclopedia Britannica*, 11 Aug. 2025, https://www.britannica.com/topic/United-Nations. Accessed 11 August 2025.\n\nShare\n\nShare to social media\n\n[Facebook](https://www.facebook.com/BRITANNICA/)\n[X](https://x.com/britannica)\n\n<https://www.britannica.com/topic/United-Nations>\n\nExternal Websites\n\n* [Geneva International Centre for Justice - United Nations Day - 24 October](https://www.gicj.org/positions-opinons/gicj-positions-and-opinions/1279-united-nations-day-24-october-2017)\n* [Jewish Virtual Library - United Nations: The United States and the Founding of the United Nations](https://www.jewishvirtuallibrary.org/the-united-states-and-the-founding-of-the-united-nations/)\n* [Official Site of the United Nations](https://www.un.org/en/)\n\nBritannica Websites\n\nArticles from Britannica Encyclopedias for elementary and high school students.\n\n* [United Nations - Children's Encyclopedia (Ages 8-11)](https://kids.britannica.com/kids/article/United-Nations/353885)\n* [United Nations - Student Encyclopedia (Ages 11 and up)](https://kids.britannica.com/students/article/United-Nations/277510)",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.01,
    "request_id": "08474570-e8b4-4543-bf9e-cd7c4a47a148"
  }
}