{
  "url": "https://www.un.org/en/high-level-week-2025",
  "timestamp": "2025-08-19T10:16:00.014671",
  "extracted": {
    "results": [
      {
        "url": "https://www.un.org/en/high-level-week-2025",
        "raw_content": "[Skip to main content](#main-content)\n\n[General Assembly  \nHigh-level Week 2025](/en/high-level-week-2025)\n\n\n \n\n## Overview\n\nThe 80th session of the United Nations General Assembly – under the theme **Better together: 80 years and more for peace, development and human rights** – comes at a pivotal moment to renew global commitment to multilateralism, solidarity and shared action for people and planet. This year’s high-level week highlights the urgency of delivering on the promise of the Sustainable Development Goals and reinvigorating global cooperation. Two key platforms will spotlight action and solutions: the flagship **[SDG Media Zone](https://www.un.org/sdgmediazone/)** produced by the UN Department of Global Communications with dynamic interviews and panel discussions on SDG solutions held from 22–26 September;  and the **Goals Lounge**, convened by the UN Deputy Secretary-General and hosted by the UN Office for Partnerships from 20-26 September, featuring unscripted dialogues, deep dives into vital issues and interactive experiences. All events are live streamed on UN WebTV.\n\n## Events\n\n* [80th Anniversary of the United Nations](#UN80)\n* [SDG Moment](#sdgmoment)\n* [30th Anniversary of the Fourth World Conference on Women](#women)\n* [General Debate](#gadebate)\n* [Climate Summit](#climatesolutions)\n* [UN - International Financial Institutions Summit](#financialinstitutions)\n* [Noncommunicable Diseases and Mental Health and Well-being](#hlm4)\n* [30th Anniversary of the World Programme of Action for Youth](#youth)\n* [International Day for the Total Elimination of Nuclear Weapons](#nuclearweapons)\n* [Situation of Rohingya Muslims and Other Minorities in Myanmar](#myanmar)\n\nPhoto: United Nations/Manuel Elías\n\n## [High-level Meeting to Commemorate the 80th Anniversary of the United Nations](https://www.un.org/pga/79/2025/05/10/letter-from-the-president-of-the-general-assembly-on-un80-programme-of-activities/)\n\nThis one-hour meeting will mark the 80th anniversary of the establishment of the United Nations, with UN officials and Heads of State and Government reflecting on the achievements of the past eight decades and the path ahead for a more inclusive and responsive multilateral system.\n\nPhoto: United Nations/Mark Garten\n\n## SDG Moment\n\nThe SDG Moment is held every year — as mandated by the 2019 SDG Summit — to highlight inspiring action on the Sustainable Development Goals. By showcasing stories of transformation from communities, countries, and regions driving change across sectors — from renewable energy to gender equality. As we cross the two-thirds mark on the road to 2030, the 2025 SDG Moment marks a critical juncture. The event will bring together a constellation of transformative global and national efforts and will demonstrate how just and inclusive transitions are accelerating progress, even in the face of global challenges.\n\nPhoto: © FAO/ Mauricio Mireles\n\n## [High-level Meeting on the 30th Anniversary of the Fourth World Conference on Women](https://docs.un.org/en/A/79/L.81)\n\nMarking the thirtieth anniversary of the Fourth World Conference on Women, the UN General Assembly will convene a high-level meeting centered on the theme “Recommitting to, resourcing and accelerating the implementation of the Beijing Declaration and Platform for Action to achieve gender equality and the empowerment of women and girls.” The meeting will reflect on progress since the landmark 1995 conference in Beijing and highlight achievements, best practices, gaps, and ongoing challenges in advancing gender equality worldwide.\n\nPhoto: United Nations/Cia Pak\n\n## [General Debate](https://gadebate.un.org/en)\n\nAt the General Debate — the annual meeting of Heads of State and Government at the beginning of the General Assembly session — world leaders make statements outlining their positions and priorities in the context of complex and interconnected global challenges. Her Excellency Annalena Baerbock, the President of the 80th session of the General Assembly, has outlined her vision under the theme “Better Together,” emphasizing unity, solidarity and collective action.\n\nPhoto: United Nations/Pasqual Gorriz\n\n## [Climate Summit](https://www.un.org/climatechange)\n\nWith the pace and scale of the climate crisis growing across the globe, the UN Secretary-General is convening a Climate Summit to serve as a platform for world leaders to present their new national climate action plans and seize the benefits of the new clean energy era. Ahead of COP30 in Brazil, the Summit will focus on demonstrating commitment and accelerating action to protect people and the planet in line with the goals of the Paris Agreement.\n\nPhoto: United Nations/Loey Felipe\n\n## [Biennial Summit between the United Nations and the International Financial Institutions](https://docs.un.org/en/A/RES/79/196)\n\nThe United Nations and international financial institutions, such as the World Bank and the International Monetary Fund, have complementary mandates in global economic governance. This first-ever Biennial Summit, mandated by last year’s [Pact for the Future](https://www.un.org/en/summit-of-the-future/pact-for-the-future), aims to strengthen existing, and establish more, systemic links and coordination between the UN and the international financial institutions, with a view to accelerating reform of the international financial architecture and strengthening the voice and representation of developing countries.\n\nPhoto: WHO / Ernest Ankomah\n\n## [High-level Meeting on the Prevention and Control of Noncommunicable Diseases and the Promotion of Mental Health and Well-being](https://www.who.int/news-room/events/detail/2025/09/25/default-calendar/fourth-high-level-meeting-of-the-un-general-assembly-on-the-prevention-and-control-of-ncds-and-the-promotion-of-mental-health-and-wellbeing-(hlm4))\n\nHeads of States and Government will meet to set a new vision for the prevention and control of noncommunicable diseases (NCDs) — including cardiovascular diseases, cancers, diabetes and chronic respiratory diseases — and the promotion of mental health and well-being towards 2030 and beyond, through a new, ambitious and achievable political declaration.\n\nPhoto: United Nations\n\n## [High-level Meeting to Commemorate the 30th Anniversary of the World Programme of Action for Youth](https://www.un.org/youthaffairs/en/WPAY30)\n\nIt has been 30 years since the World Programme of Action for Youth — the first action plan on policies and programmes for youth — was adopted by the UN General Assembly in 1995. Governments, civil society and youth partners will come together to review progress on the Programme of Action and promote greater youth participation in policymaking. Under the theme “WPAY at 30: Accelerating Global Progress Through Intergenerational Collaboration,” the meeting will focus on strengthening intergenerational partnerships and renewing commitments to advance the global youth agenda.\n\nIllustration: United Nations/Graphic Design Unit/DGC\n\n## [High-level meeting to commemorate and promote the International Day for the Total Elimination of Nuclear Weapons](https://www.un.org/en/observances/nuclear-weapons-elimination-day)\n\nAchieving global nuclear disarmament is the highest disarmament priority of the United Nations. It was the subject of the General Assembly’s first resolution in 1946, which established the Atomic Energy Commission (dissolved in 1952), with a mandate to make specific proposals for the control of nuclear energy and the elimination of atomic weapons and all other major weapons adaptable to mass destruction. This annual High-level plenary meeting commemorates and promotes the International Day for the Total Elimination of Nuclear Weapons.\n\n## [High-level Conference on the Situation of Rohingya Muslims and Other Minorities in Myanmar](https://docs.un.org/en/A/RES/79/278)\n\nThe UN General Assembly will hold a high-level plenary meeting to address the crisis facing Rohingya Muslims and other minorities in Myanmar. The meeting aims to sustain international attention, review the situation on the ground, and propose a concrete, time-bound plan for a sustainable resolution—including efforts to ensure the voluntary, safe, and dignified return of displaced communities.",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.01,
    "request_id": "5b2d2ace-6c3a-471b-91b5-7152f072dadc"
  }
}