{
  "url": "https://www.pewresearch.org/short-reads/2025/07/31/how-the-united-nations-is-funded-and-who-pays-the-most/",
  "timestamp": "2025-08-18T22:57:54.118893",
  "extracted": {
    "results": [
      {
        "url": "https://www.pewresearch.org/short-reads/2025/07/31/how-the-united-nations-is-funded-and-who-pays-the-most/",
        "raw_content": "Numbers, Facts and Trends Shaping Your World\n\n[Home](https://www.pewresearch.org) [Research Topics](https://www.pewresearch.org/topics-categorized/) [International Affairs](https://www.pewresearch.org/topic/international-affairs/) [Organizations, Alliances & Treaties](https://www.pewresearch.org/topic/international-affairs/organizations-alliances-treaties/) [United Nations](https://www.pewresearch.org/topic/international-affairs/organizations-alliances-treaties/united-nations/)\n\n* Short Reads\n\n|\n\n* [X](#)\n* [Facebook](#)\n* [Threads](#)\n* [LinkedIn](#)\n* [WhatsApp](#)\n[Share](https://pewrsr.ch/4la3tsm)\n\n# How the United Nations is funded, and who pays the most\n\nBy [Rebecca Leppert](https://www.pewresearch.org/staff/rebecca-leppert/)\n\nAs it marks its 80th year, the United Nations is facing a [major budget shortfall](https://news.un.org/en/story/2025/05/1163436). The situation could worsen as the United States – the UN’s largest funder and debtor – reassesses its ties to the organization.\n\nThe U.S. recently left several UN agencies, including the [World Health Organization](https://www.whitehouse.gov/presidential-actions/2025/01/withdrawing-the-united-states-from-the-worldhealth-organization/) and [Human Rights Council](https://www.whitehouse.gov/presidential-actions/2025/02/withdrawing-the-united-states-from-and-ending-funding-to-certain-united-nations-organizations-and-reviewing-united-states-support-to-all-international-organizations/), and plans to [withdraw from UNESCO](https://apnews.com/article/unesco-trump-withdraw-paris-united-nations-israel-129a4ffbce562e1aa497231e0bdd55a5) by the end of next year. In mid-July, Congress passed the Trump administration’s [rescissions package](https://www.congress.gov/bill/119th-congress/house-bill/4/text), pulling back about $1 billion of previously approved UN funding. And further cuts may be forthcoming: The administration’s [budget for fiscal year 2026](https://www.whitehouse.gov/wp-content/uploads/2025/05/Fiscal-Year-2026-Discretionary-Budget-Request.pdf) proposed ending UN peacekeeping payments and pausing most other UN contributions.\n\nThe [UN has responded](https://news.un.org/en/story/2025/05/1163151) to its budget crunch by curbing program spending, freezing hiring and launching a [longer-term efficiency initiative](https://news.un.org/en/story/2025/06/1164836). It’s also [dipped into its reserve accounts](https://press.un.org/en/2025/gaab4498.doc.htm#:~:text=He%20went%20on,2024%2C%20he%20said) five times since July 2019, borrowing a record $607 million in 2024. But the UN’s financial viability largely depends on how – and [whether](https://www.deseret.com/politics/2025/02/21/mike-lee-remove-us-from-un/) – the U.S. decides to support the organization moving forward.\n\n**Read on for answers to some common questions about the UN and its funding:**\n\n* [How is the UN funded?](https://www.pewresearch.org/short-reads/2025/07/31/how-the-united-nations-is-funded-and-who-pays-the-most/#how-is-the-un-funded)\n* [How much do the U.S. and other countries have to pay?](https://www.pewresearch.org/short-reads/2025/07/31/how-the-united-nations-is-funded-and-who-pays-the-most/#how-much-do-the-u-s-and-other-countries-have-to-pay)\n* [How have dues changed over time?](https://www.pewresearch.org/short-reads/2025/07/31/how-the-united-nations-is-funded-and-who-pays-the-most/#how-have-dues-changed-over-time)\n* [Do members always pay their dues?](https://www.pewresearch.org/short-reads/2025/07/31/how-the-united-nations-is-funded-and-who-pays-the-most/#do-members-always-pay-their-dues)\n* [What happens to members that don’t pay their dues?](https://www.pewresearch.org/short-reads/2025/07/31/how-the-united-nations-is-funded-and-who-pays-the-most/#what-happens-to-members-that-don%E2%80%99t-pay-their-dues)\n* [How do Americans view the UN?](https://www.pewresearch.org/short-reads/2025/07/31/how-the-united-nations-is-funded-and-who-pays-the-most/#how-do-americans-view-the-un)\n\nHow we did this\n\nAs the United States reassesses its ties to the United Nations, Pew Research Center conducted this analysis to explain how UN funding works and examine the organization’s current financial state. It primarily draws on data from the [UN Committee on Contributions](https://www.un.org/en/ga/contributions/index.shtml). Figures in this analysis list net (rather than gross) assessed contributions, which factor in [credits for countries](https://tax.un.org/content/frequently-asked-questions#:~:text=What%20is%20staff,to%20member%20states.) that don’t tax UN staff’s earnings. This analysis also draws on data about U.S. peacekeeping budget caps from the [U.S. Congressional Research Service](https://www.loc.gov/crsinfo/about/).\n\nAttitudinal data on the UN comes from a Center survey of 3,605 U.S. adults conducted March 24-30, 2025. Everyone who took part in this survey is a member of the Center’s American Trends Panel (ATP), a group of people recruited through national, random sampling of residential addresses who have agreed to take surveys regularly. This kind of recruitment gives nearly all U.S. adults a chance of selection. Interviews were conducted either online or by telephone with a live interviewer. The survey is weighted to be representative of the U.S. adult population by gender, race, ethnicity, partisan affiliation, education and other factors. [Read more about the ATP’s methodology](https://www.pewresearch.org/the-american-trends-panel/).\n\nHere are the [questions used for this analysis](https://www.pewresearch.org/wp-content/uploads/sites/20/2025/07/SR_25.07.31_un-funding_topline.pdf), along with responses, and the survey [methodology](https://www.pewresearch.org/global/2025/04/17/methodology-us-russia-ukraine/).\n\n#### How is the UN funded?\n\nThe organization is primarily funded by its 193 member states through mandatory **assessed contributions.** The UN requires separate contributions for its two main budgets:\n\n* The [regular budget](https://www.ungeneva.org/en/news-media/news/2024/12/101679/general-assembly-approves-372-billion-un-budget-2025), which finances core organizational activities that the General Assembly approves, including those related to economic and social development, disarmament projects, and human rights issues\n* The [peacekeeping operations budget](https://peacekeeping.un.org/en/how-we-are-funded), which finances most [UN peacekeeping missions](https://peacekeeping.un.org/en/where-we-operate) and several service centers worldwide\n\nThe regular budget applies to each calendar year, while the peacekeeping budget covers each fiscal year, which runs from July 1 to June 30.\n\nOther assessed contributions fund the organization’s [international tribunals](https://www.un.org/en/ga/contributions/tribunals.shtml) and special projects, such as the [renovation of the UN headquarters in New York City](https://www.un.org/en/ga/contributions/cmp.shtml).\n\nIn addition, the UN operates [many funds and programs](https://www.un.org/en/about-us/un-system), such as the World Food Program and the United Nations Children’s Fund (UNICEF), that are exclusively financed through **voluntary contributions** from member states.\n\n***Related:*** [*What the data says about U.S. foreign aid*](https://www.pewresearch.org/short-reads/2025/02/06/what-the-data-says-about-us-foreign-aid/)\n\n#### How much do the U.S. and other countries have to pay?\n\nThe amount each member must pay annually varies based on its relative “capacity to pay.” The [UN uses a formula](https://www.un.org/en/ga/contributions/budget.shtml) – which accounts for the country’s gross national income, population size and external debt, among other factors – to establish the “scale of assessments” for the regular budget. The scale ranges from 0.001% of the budget to 22%, but contributions for the least developed countries are capped at 0.01%.\n\nThe scale for the peacekeeping budget follows the same system, but [those rates are adjusted](https://www.un.org/en/ga/contributions/peacekeeping.shtml), with the five permanent member states of the [Security Council](https://main.un.org/securitycouncil/en/content/what-security-council) – China, France, Russia, the United Kingdom and the U.S. – bearing the brunt of the cost.\n\nAs the world’s largest economy, the U.S. has always been assessed at the maximum rate. This year, it was responsible for 22% of the UN’s **regular budget assessments,** or $820.4 million of the $3.5 billion net total.\n\nChina was responsible for paying the next-largest share (20.004%, or $679.8 million). Japan was a distant third at 6.930% ($235.5 million).\n\nOn the other hand, 175 of the 193 member states were each responsible for less than 1% of the UN’s regular budget in 2025. This includes 28 states assessed at the minimum 0.001% rate.\n\nThe U.S. was also assessed at the highest rate for the UN **peacekeeping budget** in 2025 (26.158%, or $6.5 million of the $25 million total). China (23.785%, or $5.9 million) and Japan (6.930%, or $1.7 million) again had the next-highest assessments.\n\n#### How have dues changed over time?\n\nLooking at just the regular budget, assessment rates have increased for the majority of states that have been UN members since 2000 (116 of 189). Vietnam, China and Guyana saw the largest increases. Meanwhile, rates stayed the same for 33 members and decreased for 40.\n\n(Montenegro, South Sudan, Switzerland and Timor-Leste are excluded from these calculations. They [became members after 2000](https://www.un.org/en/about-us/growth-in-un-membership), but their rates have remained relatively consistent – and low – since joining.)\n\nThe United States’ regular budget assessment rate was much higher in the earliest years of the UN’s existence: 39.890% in the late 1940s. It stood at 25% from 1974 until 2001, after the UN [lowered the cap](https://press.un.org/en/2000/ga9850.doc.htm) to 22%. America’s rate has remained 22% ever since.\n\nMeanwhile, the rate for China – [the world’s second-largest economy](https://www.imf.org/external/datamapper/NGDPD@WEO/OEMDC/ADVEC/WEOWORLD) – has grown significantly. It was initially around 6%, but it started to fall in the 1950s and was under 1% for most of the ’80s and ’90s. It grew slowly in the early 2000s before climbing more rapidly to its current 20.004%.\n\n#### Do members always pay their dues?\n\nContributions are due within 30 days of assessment notice from the UN Secretary General, usually around early or mid-February for the regular budget. But the UN has [long struggled](https://unis.unvienna.org/unis/en/pressrels/2000/note101.html) to get members – especially the U.S. – to pay their contributions on time, or *at all*.\n\nNo more than 53 of the 193 member states have paid their regular budget contributions on time each year since 2019 (the earliest year with detailed data available). And within the last two decades, the UN has *never* received full contributions from all members.\n\nMember states might withhold both regular budget and peacekeeping contributions for many reasons, including differences between national and UN fiscal calendars, financial constraints, or political objections to UN program goals or resolutions.\n\nHistorically, the greatest number of members pay their **regular budget dues** within the first few months of the year. The UN often sees a small spike in payments in September, but contributions otherwise trickle in slowly throughout the year.\n\nThe U.S. typically defers some of its contribution until its following fiscal year, which begins in October. This practice began in the 1980s, partially in response to America’s growing deficit.\n\nAs of April 30, 92 UN members have not paid their full regular budget assessments for 2025, [according to the latest detailed data from the UN](https://www.un.org/en/ga/contributions/Presentation%20May%202025.pdf).\n\nIncluding unpaid dues from previous years, the U.S. ($1.5 billion), China ($597 million), Russia ($72 million), Saudi Arabia ($42 million), Mexico ($38 million) and Venezuela ($38 million) have the largest outstanding regular budget balances as of April 30.\n\nThis is the sixth time since 2015 that the United States’ unpaid regular budget assessments totaled over $1 billion in April of each year. (As noted earlier, the U.S. typically defers many payments until its new fiscal year in October.)\n\nMany UN members (130) have also not made their full 2025 **peacekeeping contributions** as of April 30. Including unpaid dues from previous years, the U.S. owes $1.5 billion. That’s partly because [Congress has often capped peacekeeping spending](https://sgp.fas.org/crs/row/IF10597.pdf) at 25% since the mid-1990s, but the UN continues to assess the U.S. share of that budget at a higher rate.\n\nChina ($587 million), Russia ($123 million) and Venezuela ($93 million) owe the next-largest amounts in peacekeeping dues.\n\n#### What happens to members that don’t pay their dues?\n\nAny dues that aren’t paid by Jan. 1 of the following fiscal year are considered “arrears.” If a member’s arrears equal or exceed the amount of contributions owed for the previous two years, the member can [lose its vote in the General Assembly](https://www.un.org/en/ga/about/art19.shtml).\n\nAfghanistan, Bolivia, Sao Tome and Principe, and Venezuela currently meet these criteria. But the General Assembly [allowed Sao Tome and Principe to continue voting](https://docs.un.org/en/A/RES/79/3) until the 79th session ends this coming September, concluding that the small island nation was unable to pay for reasons outside of its control.\n\n#### How do Americans view the UN?\n\nMany Americans (63%) say they think the U.S. benefits from UN membership a great deal or fair amount, according to a Pew Research Center survey from March. The share who say this has risen slightly since [last spring](https://www.pewresearch.org/short-reads/2024/04/23/fewer-americans-view-the-united-nations-favorably-than-in-2023/) (up 3 percentage points). However, views differ widely by party.\n\nDemocrats and Democratic-leaning independents are about twice as likely as Republicans and GOP leaners to say that the country benefits from UN membership (82% vs. 43%). More Republicans instead take the opposite view: 56% don’t think the U.S. benefits much or at all, including 65% of conservative Republicans.\n\nMore broadly, a 57% majority of U.S. adults express a favorable view of the UN – up 5 points since spring 2024. While Democrats have become more likely to see the UN positively over this time span, Republicans’ views remain statistically unchanged.\n\n*Note: Here are the [questions used for this analysis](https://www.pewresearch.org/wp-content/uploads/sites/20/2025/07/SR_25.07.31_un-funding_topline.pdf), along with responses, and the survey [methodology](https://www.pewresearch.org/global/2025/04/17/methodology-us-russia-ukraine/).*\n\nTopics\n\n* [International Affairs](https://www.pewresearch.org/topic/international-affairs/)\n* [International Issues](https://www.pewresearch.org/topic/international-affairs/international-issues/)\n* [United Nations](https://www.pewresearch.org/topic/international-affairs/organizations-alliances-treaties/united-nations/)\n\nShare This Link:\n\n* [X](#)\n* [Facebook](#)\n* [Threads](#)\n* [LinkedIn](#)\n* [WhatsApp](#)\n[Share](https://pewrsr.ch/4la3tsm)\n\n[Rebecca Leppert](https://www.pewresearch.org/staff/rebecca-leppert/) is an editorial specialist at Pew Research Center.\n\n\n\nHow easy to understand is the information on this page?\n\nWhat brought you to our website?\n\nWhat is your highest level of education?\n\nIs there anything else you'd like us to know?\n\nThank you for your feedback!\n\n## Privacy Notice\n\nWe use cookies and other technologies to help improve your experience; some are necessary for the site to work, and some are optional. Learn more in our[privacy policy.](https://www.pewresearch.org/privacy-policy/)\n\n## Privacy Preference Center\n\n## Introduction and Scope\n\nThis Cookie Notice (the “Notice”) is designed to assist you in understanding how and why Pew Research Center (the “Center,” “we,” “us,” or “our”) uses cookies and other similar technologies (“Tracking Technologies”) on our family of websites, which include www.pewresearch.org and any other webpage linking to this Notice (collectively, the “Websites”) to collect and develop data. We use Tracking Technologies to allow the Websites to operate, to increase their functionality and efficiency, to enable the efficient operation of the Sites, to enhance the ease of use of the Sites, to display advertisements on the Sites and elsewhere online, to gather statistics on how you use our Sites, and to fulfill other legitimate purposes as described below.\n\nTo the extent that any information collected by the Tracking Technologies, either on its own or in combination with other information, constitutes Personal Data as the term is defined in our Privacy Policy, both our Privacy Policy and this Notice shall apply to the processing and transferring of such Personal Data.\n\nFor more information about how we use cookies click \"More Information\" below\n\n  \n[More Information](https://www.pewresearch.org/about/cookie-policy/)\n\n### Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\n\n#### Performance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\n\n#### Functional Cookies\n\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\n\n#### Targeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.0,
    "request_id": "d29a5578-be84-4b6b-9fa4-88841e8b329f"
  }
}