{
  "url": "https://www.nyc.gov/assets/cecm/downloads/pdf/manhattan-parades-street-closures-2025.pdf",
  "timestamp": "2025-08-18T22:56:36.198668",
  "extracted": {
    "results": [
      {
        "url": "https://www.nyc.gov/assets/cecm/downloads/pdf/manhattan-parades-street-closures-2025.pdf",
        "raw_content": "PARADES AND FESTIVALS IN MANHATTAN MAY 17-18, 2025 NOTICE REGARDING CHANGES TO NORMAL OPERATIONS IN YOUR AREA The City of New York provides as much information as possible to ensure that residents and business owners of affected areas are informed about interruptions to normal operations. Please be aware that there will be parades and festivals in Manhattan on the weekend of May 17-18, 2025. Please review the list of closures and restrictions below and note that all information is subject to change at the discretion of NYPD. STREET CLOSURES- PARADES Expect road closures and traffic detours beginning at 7am May 17, 2025, and ending the evening of May 18, 2025 Full Closure: Madison Avenue from 23rd Street to 38th Street (May 17-May 18) Full Closure: Sixth Avenue from West 18th Street to West 8th Street (May 17) Full Closure: West 8th Street from Sixth Avenue to Avenue A (May 17) Full Closure: Fifth Avenue from 51st Street to 79th Street (May 18) Full Closure: West Side Highway from West 14th Street to Albany Street Other closures may be in effect. (May 18) Please note there will be sidewalk closures and limited access along the sidewalks at the discretion of NYPD. There will be limited access for pedestrians and general public to traverse Northbound or Southbound along Fifth Avenue or Madison Avenue. Closed streets will re-open at approximately 7pm on Sunday May 18. See next page for additional information STREET CLOSURES-FESTIVALS 9am May 16, 2025, to 6pm, May 18, 2025 Full Closure: 7th Street between 2nd Avenue and Taras Shevchenko Place 6am May 17, 2025, to 6pm May 17, 2025 Full Closure: Greenwich Street between Reade and Jay Street. As well as Duane Street between Hudson Street and Greenwich Street. 8am May 17, 2025, to 8pm May 17, 2025 Closure (West Side of Street): Park Avenue between East 34th Street and East 40th Street 8am May 17, 2025, to 8pm May 17, 2025 Full Closure: Broadway between Waverly Place and East 14th Street 8am May 18, 2025, to 8pm May 18, 2025 Full Closure: Lexington Avenue between East 42nd Street and East 57th Street 8am May 17, 2025, to 8pm May 18, 2025 Full Closure: 9th Avenue between 42nd Street and 57th Street",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.1,
    "request_id": "9da7bbb9-6853-4a2d-953e-0a95a6baf05e"
  }
}