{
  "url": "https://www.bbc.com/news/articles/c20xvd10xv5o",
  "timestamp": "2025-08-18T22:58:43.362954",
  "extracted": {
    "results": [
      {
        "url": "https://www.bbc.com/news/articles/c20xvd10xv5o",
        "raw_content": "# 27 of the best looks from Met Gala 2025\n\nMonday night marked one of the world's biggest nights of fashion, as stars served up their most iconic looks for the annual Met Gala in New York City.\n\nThe theme for this year's event was \"Superfine: Tailoring Black Style\", the first since 2003 to focus exclusively on menswear.\n\nIt was inspired by a newly unveiled exhibit at the Metropolitan Museum of Art's costume institute featuring the \"black dandy\", which Vogue says \"examines the importance of clothing and style to the formation of black identities in the Atlantic diaspora\".\n\nA-list celebrities including Zendaya, Demi Moore and Diana Ross brought their own interpretation to the theme, stunning in tailored suits and dramatic gowns.\n\nHere is a look at some of the highlights:\n\n## Zendaya makes a statement in all-white suit\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Zendaya attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/29a5/live/e63e9950-2a39-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nActress Zendaya, known for her dazzling red carpet style, opted for a wide-brimmed hat and tailored Louis Vuitton cream suit at this year's Met Gala.\n\nBut there was one slight pop of colour: her manicured red nails.\n\n## Bad Bunny pays homage to Puerto Rico\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Bad Bunny attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/a7fb/live/60e97030-2a35-11f0-8c66-ebf25fc2cfef.jpg.webp)\n\nPuerto Rican rapper Bad Bunny wore a brown Prada suit, which he said he worked on with the Italian fashion house for a few months before the event.\n\nHe also stayed on theme by accessorising with embellished gloves, a brooch and a hat that paid homage to his Puerto Rican heritage.\n\n\"We did something special,\" he said of his look. \"I feel good, and I hope people think I'm looking good.\"\n\n## Kim Kardashian in croc-embossed leather\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Kim Kardashian attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/d461/live/d9a8f400-2a3f-11f0-b26b-ab62c890638b.jpg.webp)\n\nUS reality TV star Kim Kardashian wore an all-black ensemble by LA-based brand Chrome Hearts - a fitted leather top and skirt that she offset with diamond necklaces and two strings of pearls.\n\nShe is, of course, no stranger to the Met Gala - having made headlines with a dress worn by Marilyn Monroe in 2022, and a wet-look Thierry Mugler dress in 2019.\n\n## Sir Lewis Hamilton in a cream suit\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Sir Lewis Hamilton attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/59c2/live/909ecee0-2a37-11f0-b26b-ab62c890638b.jpg.webp)\n\nBlack British designer Grace Wales Bonner dressed British Formula One star Sir Lewis Hamilton for the night. Sir Lewis was a co-chair of this year's event.\n\nThe pair have worked together in the past with Wales Bonner dressing Hamilton for the 2023 British Fashion Awards.\n\n## Chappell Roan channels disco in hot pink\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Chappell Roan attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/1930/live/3b88e200-2a42-11f0-b26b-ab62c890638b.jpg.webp)\n\nSinger Chappell Roan brought a rare pop of colour to the Met's blue carpet, in a patchwork hot pink ensemble sourced from eBay.\n\nThe singer worked with Wicked costume designer Paul Tazewell on her outfit, while make-up artist Pat McGrath was behind her disco-inspired look.\n\n## Demi Moore with a literal interpretation\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Reuters Demi Moore attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/48d4/live/c1481cc0-2a34-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nDemi Moore gave us another round of method dressing.\n\nThe American actress's recent press tour for The Substance recalled the body horror themes of the film, while her awards campaign for the role of Elisabeth Sparkle saw her dressing for the glam statuettes.\n\nMoore understood the assignment for the Met Gala, coming as a literal men's tie in a sculptural black and white striped sequin gown from Thom Browne.\n\n## Rihanna shows off her third pregnancy\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Rihanna attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/f4f4/live/bf28c9c0-2a35-11f0-8c66-ebf25fc2cfef.jpg.webp)\n\nRihanna, typically one of the most stylish attendees at the Gala, returned to the Met steps this year in Marc Jacobs, debuting her pregnancy with co-chair of the evening A$AP Rocky.\n\n## Diana Ross' ensemble is all drama\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Diana Ross attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/d23b/live/7caae320-2a36-11f0-b26b-ab62c890638b.jpg.webp)\n\nLegendary singer Diana Ross wore a show-stopping white ensemble, complete with feathers and a long train that required at least two assistants.\n\nOn the carpet, Ross said her son persuaded her to attend this year's event. The last time she attended the Met Gala is 2003.\n\nShe added she had the names of her children and grandchildren embroidered on her dress train.\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Reuters Diana Ross attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/e5b5/live/d14e8530-2a36-11f0-b26b-ab62c890638b.jpg.webp)\n\n## Sydney Sweeney in Miu Miu\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Sydney Sweeney attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/2711/live/e5d16a80-2a37-11f0-8c66-ebf25fc2cfef.jpg.webp)\n\nActress Sydney Sweeney wore a custom Miu Miu gown - her third time wearing the designer at the Met Gala. This time, her dress was complete with beaded fringe shoulders and gold hardware detailing on the neck.\n\nSpeaking about her look, Sweeney said it paid homage to actress and painter Kim Novak. Sweeney is set to portray Novak in the upcoming film Scandalous.\n\n## Dua Lipa in matching black with Callum Turner\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Dua Lipa and Callum Turner attend the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/e601/live/c88e62d0-2a45-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nA custom-made Chanel look was Dua Lipa's choice this year.\n\nThe chiffon dress, sequin tweed jacket and organza cape - all adorned with pearls, feathers and crystals - took some 2,000 hours to make.\n\n## Sabrina Carpenter in Louis Vuitton\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Sabrina Carpenter attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/dd49/live/00285eb0-2a3e-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nSabrina Carpenter wore a burgundy Louis Vuitton bodysuit that featured all the tailoring of a regular suit.\n\nThe singer said she worked with recording artist Pharrell Williams - also the men's creative director of Louis Vuitton - on the bottomless look.\n\n\"You're quite short, so no pants for you,\" Carpenter recalled Williams telling her.\n\n## Barry Keoghan in custom Valentino\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Barry Keoghan attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/11f6/live/a63b3a80-2a38-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nIrish actor Barry Keoghan wore a custom-made Valentino fit, with florals embroidered on the cuffs and a silk red scarf wrapped around the waist.\n\n## Lorde looks sleek in Thom Browne\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Lorde attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/0a43/live/93fe89c0-2a39-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nNew Zealand singer Lorde made a rare appearance at the Met Gala this year (she has not attended since 2021).\n\nShe wore a metallic silver floor-length skirt set, and a matching bandeau and blazer designed by Thom Browne.\n\n## Simone Biles stuns in electric blue\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![AFP Simone Biles attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/5df8/live/82712bd0-2a3a-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nOlympic gymnast and gold medalist Simone Biles brought a pop of colour to the Met Gala carpet with a striking blue minidress that featured a collared neckline, a long train and jewelled appliques.\n\nThe dress was designed by Harbison Studio.\n\n## Coco Jones dazzles from head to toe\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![AFP Coco Jones attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/ae5e/live/fd65c3a0-2a3a-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nSinger Coco Jones opted for a look designed by Indian brand Manish Malhotra.\n\nShe wore a tailored cream and white look that featured ornate embroidery and a dramatic long-sleeve coat. Jones also wore a large statement necklace and Jimmy Choo heels.\n\n## Colman Domingo with two looks in one\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA /PA Colman Domingo attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/4fe6/live/355a4c80-2a3c-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nActor and playwright Colman Domingo could have inspired this year's Met Gala theme, as he's been carrying the baton for well-dressed men on the red carpet for several years now.\n\nHe donned a royal blue Valentino cloak that paid homage to Andre Leon Talley, former editor-at-large on Vogue whom Anna Wintour called \"a dandy among dandies.\"\n\nThe cape later was removed to reveal a second look underneath: a tailored, patterned suit complete with a big fabric, polka-dotted flower brooch.\n\n## Teyana Taylor is a rose in Harlem\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Teyana Taylor attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/b35b/live/a3960e50-2a3c-11f0-b26b-ab62c890638b.jpg.webp)\n\nActress and singer Teyana Taylor, who hosted Vogue's live stream of the red carpet, arrived in custom Marc Jacobs on the arm of costume designer Ruth E. Carter. Ms Carter has worked with filmmaker Spike Lee and on the Black Panther movie franchise to create some modern pop cultural cues for the black dandy.\n\nTaylor wore a burgundy cape embroidered with \"Harlem Rose,\" a nod to her 2018 song A Rose in Harlem.\n\n## Emma Chamberlain debuts new pixie cut\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Emma Chamberlain attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/d083/live/00444090-2a3d-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nSocial media influencer Emma Chamberlain looked sharp and on theme with a backless tailored suit dress designed by French fashion house Courrèges.\n\nShe accessorised the look with a spiky beach blonde pixie cut and stylish eyeglasses.\n\n## Cynthia Erivo smiles wide in Givenchy\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Cynthia Erivo attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/54da/live/8a821d40-2a3d-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nWicked's Cynthia Erivo, known for her on-theme style, wore a Givenchy ensemble featuring a bedazzled bodice and an extra-long black train with matching leather boots and nails.\n\n## Doja Cat's bold and big shoulder pads\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Doja Cat attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/f2af/live/60dfe430-2a3e-11f0-b26b-ab62c890638b.jpg.webp)\n\nRecording artist Doja Cat wore a custom Marc Jacobs look that featured giant shoulder pads and a leopard-print bustier panel.\n\n\"I just wanted to feel like a little gangsta,\" she said.\n\n\"I feel like he brought that with the strong shape of the shoulders, and all of the exaggerated shapes,\" Doja Cat said of Jacobs.\n\n## Tracee Ellis Ross in shades of pink\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Tracee Ellis Ross attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/120f/live/a4e90940-2a3e-11f0-b26b-ab62c890638b.jpg.webp)\n\nActress Tracee Ellis Ross, the daughter of Diana Ross, was one of the few people who wore pink at this year's Met Gala.\n\nShe donned a custom Marc Jacobs suit that was complete with a giant, hot pink bow at the back, a matching top hat and some unique bling.\n\n## Andre 3000 wears a piano\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Andre 3000 attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/0b9f/live/07c28460-2a3f-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nIn one of the more memorable looks of the evening, Andre 3000 showed up to the Met Gala carpet with a black and white piano strapped to his back and a trash bag as a purse.\n\nThe stylish OutKast rapper designed the look himself in collaboration with Burberry.\n\n## Lupita Nyong'o in powder blue Chanel\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Lupita Nyong'o attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/32e0/live/bcfd3960-2a44-11f0-b26b-ab62c890638b.jpg.webp)\n\nOscar-winning actress Lupita Nyong'o wore a stunning powder blue Chanel suit, with a matching hat and transparent cape.\n\nShe accessorised the look with bedazzled, black rhinestone eyebrows.\n\n## Cardi B in ivy green Burberry\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Cardi B attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/5e6b/live/f359b290-2a44-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nRapper Cardi B debuted a new hairstyle (and eye colour) in a green Burberry pantsuit, complete with matching nails and eye shadow.\n\n## Doechii makes her Met Gala debut in LV\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Doechii attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/d15b/live/112fa310-2a45-11f0-8f57-b7237f6a66e6.jpg.webp)\n\nDoechii took brand representation to new levels, stamping the famous Louis Vuitton logo on her face to go along with the motif of her suit.\n\nThe American rapper is often seen wearing looks from the French fashion house.\n\nThis outfit combined the designer's two famous patterns - the LV monogram pattern on the waistcoat and jacket, as well as the damier checkerboard on the shorts.\n\n## Janelle Monae is on theme (and on time)\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![EPA Janelle Monae attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/d34f/live/3dda92d0-2a45-11f0-8c66-ebf25fc2cfef.jpg.webp)\n\nWhen asked about her outfit on the carpet, Janelle Monáe responded simply - \"free\" - followed by an expletive.\n\n\"And when I'm in my suit, that is exactly how I feel,\" she said.\n\nShe wore a Thom Brown suit, with whom she's attended the Met Gala as a guest for the last several years. The look is styled by the Academy Award-winning costume designer for Wicked, Paul Tazewell.\n\n## Madonna references herself\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Getty Images Madonna attends the 2025 Met Gala Celebrating \"Superfine: Tailoring Black Style\" at Metropolitan Museum of Art on May 05, 2025 in New York City, US.](https://ichef.bbci.co.uk/news/480/cpsprodpb/7921/live/687bf6f0-2a45-11f0-b26b-ab62c890638b.jpg.webp)\n\nPop legend Madonna accessorised her cream-colored tuxedo with a cigar, creating an interplay between soft feminine materials and a distinct masculine energy.\n\nIt's a dynamic that the superstar has played with throughout her career.\n\n## Former woollen mills could be turned into flats\n\n## 'Time to retire after 45 years of six-day weeks'\n\n## Student makes prize-winning outfit from meat netting\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![A woman wearing white shorts and a black tank top takes a photo of large waves as they break on the beach in the Dominican Republic.  ](https://ichef.bbci.co.uk/news/480/cpsprodpb/693b/live/332f66a0-7c14-11f0-8db5-596ea140e19b.jpg.webp)\n\n## US East Coast faces life-threatening waves from Hurricane Erin\n\nThe Category 4 storm threatens to bring life-threatening surf and rip currents to the US East Coast.\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![A crew member of Anka cargo vessel, which is abandoned at an Ukrainian port in a river dividing Ukraine and Romania, in blue shirt, watches the expanse of the river from the bow of the vessel.](https://ichef.bbci.co.uk/news/480/cpsprodpb/302c/live/4a544100-79e6-11f0-ab39-5f560085c471.jpg.webp)\n\n## Why India tops the list of abandoned sailors\n\nAround 900 Indian sailors were abandoned on ships across the world in 2024.\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Friends star Matthew Perry is seen in a black suit ](https://ichef.bbci.co.uk/news/480/cpsprodpb/f9aa/live/19eb83f0-7c6d-11f0-b2a5-a19d6935816e.jpg.webp)\n\n## 'Ketamine Queen' to plead guilty in Matthew Perry overdose case\n\nThe American-British dual-national is one of five people who were charged with supplying ketamine to the actor.\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Voters casting their votes at a US election polling station](https://ichef.bbci.co.uk/news/480/cpsprodpb/5b0a/live/807b7660-7c78-11f0-87e5-1188e921fae0.jpg.webp)\n\n## Newsmax settles Dominion election defamation case for $67m\n\nDominion had accused Newsmax of broadcasting \"verifiably false lies\" following President Joe Biden's victory in 2020.\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)\n![Texas lawmaker Gene Wu is seen in a suit in front of an American flag being recorded on another man's mobile phone.](https://ichef.bbci.co.uk/news/480/cpsprodpb/b427/live/3b1fc830-7c4d-11f0-b34b-3f615028e3e9.jpg.webp)\n\n## Texas Democrats return home after redistricting row\n\nRepublican lawmakers are expected to quickly pass new voting maps, but Democrats still say they were victorious in the standoff.\n\nCopyright 2025 BBC. All rights reserved. The *BBC* is *not responsible for the content of external sites.* [**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.53,
    "request_id": "b780ad6b-fd41-4bf6-a784-36097f0acf4f"
  }
}