{
  "url": "https://www.metmuseum.org/policies/directions-and-parking",
  "timestamp": "2025-08-19T10:18:16.806389",
  "extracted": {
    "results": [
      {
        "url": "https://www.metmuseum.org/policies/directions-and-parking",
        "raw_content": "# Directions and Parking\n\n### The Met Fifth Avenue\n\n#### By Subway/Bus\n\n**From East Side of Manhattan:** Subway: Take the 4, 5, or 6 train to 86th Street and walk three blocks west to Fifth Avenue. This walk is about a half mile and takes approximately 10 minutes. Bus: Take the M1, M2, M3, or M4 bus along Fifth Avenue (from uptown locations) to 82nd Street or along Madison Avenue (from downtown locations) to 83rd Street.\n\n**From West Side of Manhattan:** Take the 1 train to 86th Street, then the M86 crosstown bus across Central Park to Fifth Avenue; OR take the C train to 81st Street, then the M79 bus across Central Park to Fifth Avenue.\n\n**From Penn Station:** Take the M4 bus to 83rd Street and Madison Avenue; OR take the C local train to 81st Street and transfer to the M79 crosstown bus across Central Park to Fifth Avenue.\n\n**From The Met Cloisters:** Take the M4 bus directly to 82nd Street and Fifth Avenue; OR take the A train to 125th Street, transfer to the B or C local train, exit at 81st Street, and transfer to the M79 crosstown bus across Central Park to Fifth Avenue.\n\nSome transfers are free. Please note: *Certain restrictions apply to bus and train transfers*. Please visit the [MTA website](http://www.mta.info/) for additional details, and for bus and subway maps.\n\n#### By Sightseeing Tour Bus\n\nGray Line NY Sightseeing Tours and CitySights NY Bus Tours: Uptown Loop, Stop #35\n\n#### By Metro-North Railroad\n\nTake the Hudson, Harlem, or New Haven Line to Grand Central. From there, take the following:\n\nSubway: Take the 4, 5, or 6 train to 86th Street and walk three blocks west to Fifth Avenue. This walk is about a half mile and takes approximately 10 minutes.\n\nBus: Take the M1, M2, M3, or M4 bus along Madison Avenue to 83rd Street.\n\n#### By Car\n\n**From The Met Cloisters, Bronx, Northern New Jersey, and New England:** Take southbound Henry Hudson Parkway to 96th Street exit; cross Central Park and turn right on Fifth Avenue; enter Museum parking garage at 80th Street.\n\n**From Brooklyn and Staten Island:** Take Williamsburg Bridge, Manhattan Bridge, Brooklyn Bridge, or Battery Tunnel to northbound/uptown FDR Drive; exit at 96th Street; proceed straight onto York Avenue; turn right on 86th Street; turn left on Fifth Avenue and enter Museum parking garage at 80th Street.\n\n**From Southern New Jersey:** Take New Jersey Turnpike to Holland Tunnel–Uptown exit; northbound Hudson Street becomes Eighth Avenue, which becomes Central Park West; at 86th Street, turn right and cross Central Park; turn right on Fifth Avenue and enter Museum parking garage at 80th Street.\n\n**From Bronx, Queens, Long Island, Upstate New York, and New England via RFK Bridge:** Take southbound/downtown FDR Drive to 96th Street exit; proceed straight onto York Avenue; turn right on 86th Street; turn left on Fifth Avenue and enter Museum parking garage at 80th Street.\n\n**From Queens and Long Island via Queensborough Bridge:** Use either level; take right-lane exit onto 60th Street (westbound); at Madison Avenue, turn right and drive north/uptown; turn left on 81st Street then left on Fifth Avenue; enter Museum parking garage at 80th Street.\n\n#### Information for Bus Drivers\n\nBuses are not permitted to stand or park on Fifth Avenue. Buses may stop long enough to unload or load passengers. Please note that these laws are strictly enforced by the New York City Police Department and Department of Transportation. After unloading on Fifth Avenue at 83rd Street, buses may cross Central Park at 79th Street or 65th Street and proceed to West 62nd Street between Columbus Avenue and Amsterdam Avenue, most of which is reserved for bus layovers. The recommended return route is north on Amsterdam Avenue to 86th Street, east on 86th Street across Central Park, and south on Fifth Avenue.\n\nVisit the official [New York City website](https://www1.nyc.gov/html/dot/html/ferrybus/charterbus.shtml) for updated motor coach regulations and Charter Bus Parking Guidelines.\n\n#### Parking\n\nThe Museum parking garage, located at Fifth Avenue and 80th Street, is open 24 hours a day, seven days a week. A parking discount is available to Met Museum Members during Museum operating hours. To receive a discount, Museum Members must have their tickets validated at the Uris Center for Education Membership/Visitor Information Desk. For more information, please call 212-570-1437.\n\n![ ](https://cdn.sanity.io/images/cctd4ker/production/06fcffb6826cb6434f484ab24f48e5d544a6768f-782x782.png?w=3840&q=75&fit=clip&auto=format)\n\n[Pre-book your parking spot here.](https://grs-reservationserviceesb.lazparking.com/checkout/?l=127111&wk=c2f0d336cf314108a53eb77d8431b72e&wt=tmd)\n\nDesignated spaces are available in the parking garage for visitors with disabilities. The clearance is six feet, six inches (6' 6\"). Alternate arrangements can be made in advance for visitors with disabilities traveling in oversized vehicles. Please call 212-570-1437 for more information. Bicycle racks are provided inside the Museum parking garage, located at Fifth Avenue and 80th Street, during regular Museum hours for free.\n\n### The Met Cloisters\n\n#### By Subway/Bus\n\nTake the A train to 190th Street and exit the station by elevator. Walk north along Margaret Corbin Drive for approximately 10 minutes or transfer to the M4 bus and ride north one stop. If you are coming from The Met Fifth Avenue, you may also take the M4 bus directly from Madison Avenue/83rd Street to the last stop. (Please allow more time for this option.)\n\n**Please note:** Ongoing track maintenance and line closures may affect A train service during the weekend. Check the [Metropolitan Transit Authority's website](http://www.mta.info/nyct) for the latest information.\n\n![ ](https://cdn.sanity.io/images/cctd4ker/production/becfc2720935c1ccbdc4ed7f4b849c844146ffe4-2112x1560.jpg?w=3840&q=75&fit=clip&auto=format)\n\n#### By Car\n\nTake Henry Hudson Parkway northbound to the first exit after George Washington Bridge (Fort Tryon Park & The Cloisters). This exit is only accessible from the northbound lane; if coming from the north, take Henry Hudson Parkway southbound to exit 14 & 15, make a U-turn, and travel north one mile to the exit marked Fort Tryon Park & The Cloisters.\n\n#### Parking\n\nVisitors to The Met Cloisters may use free city parking available in Fort Tryon Park. Two designated spaces in the public parking area facing the front of the Museum are available for disabled parking permit holders.",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.01,
    "request_id": "a09769ac-b80b-44bf-8caa-b6fd1453043f"
  }
}