{
  "url": "https://www.cnn.com/2025/05/05/style/met-gala-2025-red-carpet-fashion",
  "timestamp": "2025-08-18T22:58:40.060388",
  "extracted": {
    "results": [
      {
        "url": "https://www.cnn.com/2025/05/05/style/met-gala-2025-red-carpet-fashion",
        "raw_content": "# Met Gala 2025: The best looks from the red carpet\n\nRihanna arrives at the Met Gala in New York on May 5.\n\nJohn Shearer/WireImage/Getty Images\n\nCNN\n —\n\nNew York’s Metropolitan Museum of Art came alive with tributes to [Black history, culture and style](https://www.cnn.com/2025/05/03/style/black-dandyism-met-gala-theme) as the annual Met Gala got underway Monday evening.\n\nThe rain did little to dampen spirits on fashion’s big night out, where designers, models and stylists ascended the Met’s iconic — and for the night, blue-carpeted — stairs alongside A-list names from sports, arts and entertainment.\n\nAd Feedback\n\nThis year’s hotly anticipated dress code, “Tailored for You,” was inspired by the Costume Institute’s accompanying exhibition “Superfine: Tailoring Black Style,” which explores the history of Black dandyism. The Met [says](https://www.metmuseum.org/press-releases/ci-2025-exhibition-gala-details) its annual theme is designed to “provide guidance and invite creative interpretation.”\n\nVideo Ad Feedback\n\nSymbolism, tribute and spectacle: A deeper look at the 2025 Met Gala\n\n01:45\n - Source:\n[CNN](https://www.cnn.com/)\n\nSymbolism, tribute and spectacle: A deeper look at the 2025 Met Gala\n\n01:45\n\nIt did both, with many attendees putting a contemporary spin on zoot suits, the wide-shouldered, high-waisted suits popularized by African American men in the 1940s. Speaking to CNN ahead of his arrival at the gala, fashion designer Dapper Dan said “real dandyism” began with zoot suits, jazz and the Harlem Renaissance movement. “It’s when Black artists and creatives began to dress the way they felt,” he added.\n\nThis year marked the first Met Gala dress code centered on menswear, challenging designers to reinterpret tailoring traditions for their female clients. The red carpet was awash with exaggerated suiting, from the broad shoulders of Doja Cat’s 1980s-inspired Marc Jacobs blazer to the wide-lapeled jackets sported by everyone from actor Tessa Thompson to rapper Doechii.\n\nJanelle Monáe wowed with a suit-within a suit — an outerwear jacket, printed with a blazer and necktie, that she removed to reveal an actual suit (she completed the look with a bowler hat and a clock monocle with spinning hands). Other standout tailored looks included Zendaya’s Louis Vuitton three-piece and Lupita Nyong’o’s all-aquamarine Chanel look with a matching chiffon cape and hat.\n\nJanelle Monáe arrived in a long jacket printed to resemble a suit and necktie, as well as a bowler hat and monocle.\n\nMichael Buckner/Penske Media/Getty Images\n\nThe singer and actor then removed the jacket to reveal a time-traveler-inspired black-and-red Thom Browne outfit.\n\nChristopher Polk/Shutterstock\n\nThe evening’s men also embraced colorful, theatrical suiting: “Bridgerton” actor Regé-Jean Page in all red, Henry Golding in — fittingly — gold and musician Bad Bunny in a loose-fitting brown two-piece paired with a Puerto Rican pava hat.\n\nElsewhere, attendees used the theme to pay homage to individual Black icons. In the first of two red-carpet looks, Oscar-nominated actor Colman Domingo, one of the Met Gala’s co-chairs, arrived in a blue Valentino cape that evoked Vogue’s former editor-at-large André Leon Talley. Formula 1 driver (and fellow co-chair) Lewis Hamilton said his patent leather shoes were also a reference to the late fashion journalist — as was Anne Hathaway’s white-button down shirt and Carolina Herrera column dress.\n\n[NEW YORK, NY - MAY 04: Rihanna attends the \"China: Through The Looking Glass\" Costume Institute Benefit Gala at the Metropolitan Museum of Art on May 4, 2015 in New York City. (Photo by Mike Coppola/Getty Images)\n\nMike Coppola/Getty Images North America/Getty Images\n\nvideo\n\nRelated video\nWhy these Met Gala moments stand out in history](/2025/05/05/style/video/memorable-met-gala-moments-history-ldn-digivid)\n\nOthers looked closer to home, with “The Bear” star Ayo Edebiri telling Vogue that her Ferragamo look nodded to the dandy men in her life, including her father. Supermodel Gigi Hadid’s Miu Miu dress was inspired by Zelda Wynn Valdes, a pioneering Black fashion designer who dressed the likes of Josephine Baker and Ella Fitzgerald, while Jodie Turner-Smith channeled equestrian Selina Lazevski.\n\nAnd then there were the Black icons themselves: Diana Ross, making her first appearance at the gala since 2003, arrived in a 60-pound, 18-foot-long train embroidered with the names of all her children and grandchildren.\n\n*Scroll down to see some of the evening’s best looks.*\n\nLauryn Hill made her first Met Gala appearance in a sculptural pale-yellow suit and matching train. Her jewelry, created by jeweler and curator Emefa Cole, paid homage to Ghanaian royalty.\n\nSavion Washington/Getty Images\n\nHalle Berry graced the blue carpet in a sheer mermaid gown with a plunging neckline and strategically placed stripes.\n\nJohn Shearer/WireImage/Getty Images\n\nCardi B in a lush green velvet Burberry suit with wide-legged pants.\n\nDimitrios Kambouris/Getty Images\n\nThe very last to arrive, Rihanna delivered on the \"Superfine\" theme with a custom Marc Jacobs look featuring a wool jacket, bustier bodysuit and V-tailored skirt. The star also used the red carpet to reveal her third pregnancy.\n\nDia Dipasupil/Getty Images\n\nUsher and his wife Jennifer Goicoechea arrived in Ralph Lauren and sharply tailored Sergio Hudson, respectively.\n\nMichael Buckner/Penske Media/Getty Images\n\nWith her Met Gala look, Tessa Thompson aimed to signify “the way fashion illustrates our dignity,” she told Billboard. Her old-school church fan featured the face of Vogue’s former editor-at-large André Leon Talley, whom many Met Gala guests honored tonight.\n\nDia Dipasupil/Getty Images\n\nKim Kardashian opted for a head-to-toe leather look by luxury brand Chrome Hearts.\n\nEvan Agostini/Invision/AP\n\nChappell Roan was a “femininomenon” in a hot pink, ‘70s-style bedazzled suit.\n\nDimitrios Kambouris/Getty Images\n\nLizzo wowed in suited glam and a platinum blonde do.\n\nDia Dipasupil/Getty Images\n\nMaking his first Met Gala appearance, Punjabi musician and actor Diljit Dosanjh emulated Sir Bhupinder Singh, an early Indian dandy of the 20th century.\n\nDimitrios Kambouris/Getty Images\n\nDoja Cat went punk in an ‘80s-style custom Marc Jacobs look that was inspired by “Mother Africa,” she said on Vogue’s Met Gala carpet livestream.\n\nDia Dipasupil/Getty Images\n\nKylie Jenner's look was created for her by Ferragamo designer Maximilian Davis. Her boyfriend, Timothée Chalamet, was not in attendance.\n\nJamie McCarthy/Getty Images\n\nAn icon of dandyism, Dapper Dan represented both the sartorial present and past of the Black diaspora, calling back to the Harlem Renaissance and the Ghanaian concept of “Sankofa.\"\n\nJamie McCarthy/Getty Images\n\nFKA Twigs’ custom Wales Bonner dress evoked Josephine Baker, the first Black woman to star in a major motion picture.\n\nTheo Wargo/FilmMagic/Getty Images\n\n“The White Lotus” stars Aimee Lou Wood and Patrick Schwarzenegger wore custom Priya Ahluwalia and Balmain, respectively. Wood’s look entailed a cropped suit jacket and a matching train, while Schwarzenegger’s appears to be a modern twist on the zoot suits popular in 1930s and 1940s Harlem.\n\nDimitrios Kambouris/Getty Images\n\nWNBA star and Met Gala host committee Angel Reese looked chic in a custom Thom Browne gown and a sleek bob.\n\nKevin Mazur/MG25/Getty Images\n\nBollywood star Shah Rukh Khan accessorized his black Sabyasachi ensemble with statement jewelry and a cane.\n\nDimitrios Kambouris/Getty Images\n\nAyo Edebiri’s Ferragamo look was inspired by the dandy men in her life, including her father, she told Vogue.\n\nDia Dipasupil/Getty Images\n\nMindy Kaling wore custom Harbison Studio, embellished with golden brooches and pops of red.\n\nEvan Agostini/Invision/AP\n\nStylist Law Roach, attending the Met Gala as an event consultant and partner for Burberry, sourced all his accessories from eBay, he told Vogue's livestream hosts — including his Cartier ring and Tiffany brooches.\n\nDimitrios Kambouris/Getty Images\n\n“Euphoria” actress Hunter Schafer arrived in a monochrome, multi-layered suit and flared pants, topped with a white beret.\n\nMichael Loccisano/GA/The Hollywood Reporter/Getty Images\n\n\"Bridgerton\" actor Regé-Jean Page arrived in a striking all-red ensemble by Brioni.\n\nDimitrios Kambouris/Getty Images\n\nSprinter Sha’Carri Richardson’s sunny yellow chiffon dress, by Valentino, was layered with a floral lace turtleneck bodice.\n\nJamie McCarthy/Getty Images\n\nHenry Golding was suitably golden in a shimmering Ozwald Boateng three-piece suit and Cartier jewelry.\n\nJamie McCarthy/Getty Images\n\nDemi Moore’s take on dandyism took the form of an outsized pinstripe necktie, with accessories by Shiphra Jewelry.\n\nDavid Fisher/Shutterstock\n\nSerena Williams modernized old Hollywood glam with an ice blue Bardot-style Moncler gown, oversized coat and golden finger waves.\n\nDimitrios Kambouris/Getty Images\n\nFor Cynthia Erivo’s fourth Met Gala appearance, the “Wicked” star donned a custom Givenchy look by the house’s creative director, Sarah Burton.\n\nDimitrios Kambouris/Getty Images\n\nModel Alton Mason’s glittery chrome ensemble featured a unique heart-shaped neckline.\n\nDimitrios Kambouris/Getty Images\n\nMiley Cyrus donned custom Alaïa with Cartier jewelry.\n\nMichael Loccisano/GA/The Hollywood Reporter/Getty Images\n\nDoechii worked closely with Louis Vuitton creative director Pharrell Williams on her look, which was inspired by the book (“Slaves to Fashion: Black Dandyism and the Styling of Black Diasporic Identity”) that is the basis for the Costume Institute’s exhibition, the rapper told Vogue carpet co-hosts.\n\nJamie McCarthy/Getty Images\n\nAndrew Scott, one of the most consistently stylish red-carpet dressers of recent years, in a dandy-inspired Giuliva Heritage suit paired with a Swarovski brooch.\n\nDimitrios Kambouris/Getty Images\n\nK-pop star Lisa arrived at her first Met Gala with Louis Vuitton branding threaded into her hose, jacket and bodysuit. But LV logos weren't the only emblems threaded into her look — it also featured miniature embroidered versions of portraits by Henry Taylor, the artist behind Pharrell Williams’ Vogue cover.\n\nJamie McCarthy/Getty Images\n\nKarlie Kloss debuted her baby bump in a plunging black gown.\n\nDimitrios Kambouris/Getty Images\n\n“The White Lotus” star Walton Goggins put a fun spin on classic menswear in a long blazer and skirt by Thom Browne.\n\nMichael Loccisano/GA/The Hollywood Reporter/Getty Images\n\nMegan Thee Stallion channels singers Josephine Baker and Eartha Kitt, with her beehive-esque ponytail reminiscent of a hairstyle once worn by the former.\n\nJamie McCarthy/Getty Images\n\nSabrina Carpenter represented Louis Vuitton with a pinstriped leotard and tailcoat. Carpenter worked with the brand’s creative director of menswear Pharrell Williams who, she said, told her: “You’re quite short, no pants for you,” she recalled during Vogue's red carpet livestream.\n\nDimitrios Kambouris/Getty Images\n\nMet Gala co-chair A$AP Rocky arrived in a dapper, self-designed suit from his own label, AWGE.\n\nJohn Shearer/WireImage/Getty Images\n\nDua Lipa arrived in a custom black chiffon, feather and organza Chanel number, which took 2,000 hours and 45,000 embroidered elements to craft, according to Vogue.\n\nJohn Shearer/WireImage/Getty Images\n\nAnne Hathaway wore a relaxed custom Carolina Herrera that she said honored the late André Leon Talley. “We wanted (him) to look down from heaven and scream, ‘glamour!’” Hathaway said.\n\nDimitrios Kambouris/Getty Images\n\nBad Bunny honored his heritage by topping his look with a Puerto Rican pava hat.\n\nJohn Shearer/WireImage/Getty Images\n\nGabrielle Union and Dwyane Wade in complementary black-and-white ensembles by Prada.\n\nEvan Agostini/Invision/AP\n\nAva DuVernay’s custom Prada look was a modern replica of an outfit worn by her grandmother in a photograph taken in 1919, she told Variety.\n\nJamie McCarthy/Getty Images\n\nBarry Keoghan, who will play Ringo Starr in a forthcoming Beatles biopic, seemingly channeled the band’s \"Sgt. Pepper's Lonely Hearts Club Band\" era in his custom Valentino look.\n\nTheo Wargo/FilmMagic/Getty Images\n\nLupita Nyong’o, a Chanel brand ambassador, wore a custom aquamarine lurex wool jacket embellished with a satin collar. The Chanel ensemble references look No. 67 from the brand’s fall-winter 2015/16 haute couture collection.\n\nDia Dipasupil/Getty Images\n\nGigi Hadid’s dazzling golden Miu Miu gown was created in collaboration with Gabriella Karefa-Johnson, former Vogue fashion editor and the first Black woman to style a Vogue cover. The look was inspired by pioneering fashion designer Zelda Wynn Valdes.\n\nJamie McCarthy/Getty Images\n\nBlackpink’s Jennie, in Chanel, sported a black leather satin jumpsuit, adorned with pearls, with an overskirt, a white silk camelia and a top hat.\n\nDimitrios Kambouris/Getty Images\n\nWearing a red suit designed by Orange Culture, a Nigerian fashion brand, \"Atlanta\" star Brian Tyree Henry posted on Instagram that he was “fine and dandy like cinnamon candy.”\n\nDia Dipasupil/Getty Images\n\nOlympic gymnast Simone Biles’ sleeveless blue Harbison Studio dress featured a bow and a long train.\n\nDimitrios Kambouris/Getty Images\n\nZoe Saldaña put an inventive spin on tailored menswear in a Thom Browne suit-dress.\n\nDimitrios Kambouris/Getty Images\n\nDiana Ross, who hasn’t been to the Met Gala since 2003, told Vogue that her decision to attend was a last-minute one. But her regalia suggests otherwise: The train of her show-stopping “forever family gown,” as she called it, was embroidered with the names of her five children and eight grandchildren. It weighs 60 pounds and is 18 feet long.\n\nMichael Loccisano/GA/The Hollywood Reporter/Getty Images\n\nRapper Pusha T, in a hand-embroidered burgundy pinstriped blazer and matching flared pants, was among numerous stars wearing Louis Vuitton custom-designed by Met Gala co-chair Pharrell Williams.\n\nMichael Loccisano/GA/The Hollywood Reporter/Getty Images\n\nPamela Anderson, sporting a new bob haircut, arrived in a floor-length, long-sleeved silver sequined gown by Tory Burch.\n\nDavid Fisher/Shutterstock\n\nChanneling ‘70s Bianca Jagger, Zendaya arrived in a custom white silk single-breasted Louis Vuitton tuxedo with a waistcoat, silk tie, felt hat, platform pumps and flared trousers — styled, of course, by Law Roach.\n\nDimitrios Kambouris/Getty Images\n\n“Stranger Things” star Sadie Sink, a Prada brand ambassador, made her Met Gala debut in custom gothic look from the Italian label.\n\nEvan Agostini/Invision/AP\n\nMaya Hawke in a blush gown and cape by Prada.\n\nJamie McCarthy/Getty Images\n\nBroadway star Kara Young took a monochrome approach, wearing a cocoa-colored suit with a structured silhouette and cropped sleeves that revealed long gloves underneath.\n\nSavion Washington/Getty Images\n\nSinger and actor Audra McDonald’s look, designed for her by Charles Harbison, was inspired by the 1991 movie “Daughters of the Dust.”\n\nJamie McCarthy/Getty Images\n\n“Succession” star Sarah Snook’s menswear-inspired look featured a wide-shouldered black tuxedo with a trailing cape.\n\nDimitrios Kambouris/Getty Images\n\nTony Award-winning actor Adrienne Warren wore a white silk satin-faced organza ruffle blouse with a black corseted cummerbund evening skirt, all designed by Sergio Hudson.\n\nJamie McCarthy/Getty Images\n\nCoco Jones’ custom Manish Malhotra attire was a regal hybrid of structure and movement, with her floral applique-embroidered blazer descending into a floor-sweeping train. “This is where fashion meets intention,” Jones said of the event’s theme.\n\nDavid Fisher/Shutterstock\n\nPharrell Williams, who is serving as a co-chair of the event, wore a double-breasted Louis Vuitton blazer, made using 15,000 pearls, that took 400 hours to make. Williams’ wife, Helen Lasichanh, wore a corseted leather bodysuit and tights patterned with the logo of Louis Vuitton.\n\nMichael Loccisano/GA/The Hollywood Reporter/Getty Images\n\nSydney Sweeney dazzled in a black sequined Miu Miu gown with tasseled and beaded sleeves. The look was inspired by actress Kim Novak’s look in the 1968 movie “The Legend of Lylah Clare.”\n\nDia Dipasupil/Getty Images\n\nEvent co-chair Colman Domingo’s first Met Gala look was a dramatic, floor-sweeping Valentino cape, referencing both royalty and the late André Leon Talley’s iconic 2011 Met Gala outfit.\n\nEvan Agostini/Invision/AP\n\nBeneath the cape, Domingo wore a black and butter checkered wool Valentino jacket, embellished with pearl and crystal embroidery.\n\nDimitrios Kambouris/Getty Images\n\nModel Christian Latchman, the face of the Costume Institute exhibition's catalog cover, arrived at the Met Gala in a whimsical cream-colored suit and pleated train.\n\nKevin Mazur/MG25/Getty Images\n\nMet Gala co-chair Lewis Hamilton stunned in a custom white Wales Bonner tuxedo. “The color ivory denotes purity and status,” and “ancestral beads and freshwater pearls shine with garnet-colored diamonds… eternal amulets,” stylist Eric McNeal wrote on Instagram.\n\nMichael Loccisano/GA/The Hollywood Reporter/Getty Images\n\n\"Saturday Night Live\" comedian Ego Nwodim arrived at the Met Gala in custom Christopher John Rogers.\n\nDimitrios Kambouris/Getty Images\n\nA first-time Met Gala attendee, pianist Gina Alice Redlinger wore a black-and-white mermaid dress with piano-themed clutch.\n\nEvan Agostini/Invision/AP\n\nTeyana Taylor’s look was finished with an extravagant, pleated crimson red cape embroidered with “Harlem Rose.”\n\nDimitrios Kambouris/Getty Images\n\nDesigned by Taylor and Ruth E. Carter, the ensemble is partly a nod to Taylor's 2018 song “Rose in Harlem,” which pays homage to her upbringing in the neighborhood. The pleats represent the opening of the rose, Carter told BET.\n\nDia Dipasupil/Getty Images\n\nAnna Wintour, editor-in-chief of Vogue, wears a floor-length baby-blue coat designed by Pharrell Williams for Louis Vuitton.\n\nDia Dipasupil/Getty Images\n\nYouTube star and Vogue host Emma Chamberlain struck a pose in a femme version of a pinstripe suit, accessorizing with sheer gloves.\n\nJamie McCarthy/Getty Images\n\nDonning an archival Off-White design, by the label's late creative director Virgil Abloh, La La Anthony said via Instagram that she was honored to carry on the brand’s legacy at the event.\n\nEvan Agostini/Invision/AP\n\n*Correction: A caption in this story previously misstated one of the designers for Teyana Taylor’s outfit.*\n\ninfo\n\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\n\n## Up next\n\n[Tropical storm watch issued for North Carolina coast, as Hurricane Erin brings life-threatening rip currents to Outer Banks\n\nAug 18, 2025\n\n6 minute readmin read](https://www.cnn.com/2025/08/18/weather/hurricane-erin-impacts-tracking-atlantic-climate-hnk?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=popular.article.en)\n\n[Itsy Bitsy Teenie Weenie: This is the latest celebrity-favorite bikini\n\nAug 18, 2025\n\n4 minute readmin read](https://www.cnn.com/2025/08/18/style/frankies-bikinis-celebrity-cool-girl-brand?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=popular.article.en)\n\n[Donbas: The object of Putin’s desire and the crux of the war in Ukraine\n\nAug 18, 2025\n\n3 minute readmin read](https://www.cnn.com/2025/08/18/europe/donbas-the-object-of-putins-desire-and-the-crux-of-the-war-in-ukraine?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=popular.article.en)\n\n[What would happen if America started faking its economic data? Here’s what happened when other countries did it\n\nAug 18, 2025\n\n6 minute readmin read](https://www.cnn.com/2025/08/18/business/countries-fake-economic-data?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=popular.article.en)\n\n[An atheist began caring for the dying. What he saw changed his view of faith — and the afterlife\n\nAug 17, 2025\n\n14 minute readmin read](https://www.cnn.com/2025/08/17/us/atheist-hospice-deathbed-visions-faith-cec?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=popular.article.en)\n\ninfo\n\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\n\n## Most read\n\n[Tropical storm watch issued for North Carolina coast, as Hurricane Erin brings life-threatening rip currents to Outer Banks\n\n6 minute readmin read](https://www.cnn.com/2025/08/18/weather/hurricane-erin-impacts-tracking-atlantic-climate-hnk?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Itsy Bitsy Teenie Weenie: This is the latest celebrity-favorite bikini\n\n4 minute readmin read](https://www.cnn.com/2025/08/18/style/frankies-bikinis-celebrity-cool-girl-brand?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Donbas: The object of Putin’s desire and the crux of the war in Ukraine\n\n3 minute readmin read](https://www.cnn.com/2025/08/18/europe/donbas-the-object-of-putins-desire-and-the-crux-of-the-war-in-ukraine?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[What would happen if America started faking its economic data? Here’s what happened when other countries did it\n\n6 minute readmin read](https://www.cnn.com/2025/08/18/business/countries-fake-economic-data?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[An atheist began caring for the dying. What he saw changed his view of faith — and the afterlife\n\n14 minute readmin read](https://www.cnn.com/2025/08/17/us/atheist-hospice-deathbed-visions-faith-cec?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Texas Democrats return to the state as GOP pushes ahead with redistricting\n\n9 minute readmin read](https://www.cnn.com/2025/08/18/politics/texas-california-redistricting-fight?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Trump’s remarkable statement against states’ rights\n\n4 minute readmin read](https://www.cnn.com/2025/08/18/politics/mail-voting-trump-states-rights-analysis?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Takeaways from Trump’s meetings with Zelensky and European leaders\n\n6 minute readmin read](https://www.cnn.com/2025/08/18/politics/takeaways-trump-zelensky-european-leader-meetings?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Federal agents open fire at San Bernardino family during enforcement operation, DHS says\n\n3 minute readmin read](https://www.cnn.com/2025/08/18/us/federal-agents-open-fire-san-bernardino-enforcement-hnk?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Fact check: Trump repeats false Ukraine aid figure while sitting with Zelensky\n\n5 minute readmin read](https://www.cnn.com/2025/08/18/politics/ukraine-aid-trump-zelensky-fact-check?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\ninfo\n\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\n\n## Up next\n\n[23 best wedding guest dresses from Amazon, according to stylists\n\nMay 1, 2025\n\n6 minute readmin read](https://www.cnn.com/cnn-underscored/fashion/best-wedding-guest-dresses-amazon?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=related.en)\n\n[A viral hit, this $38 Amazon nightgown dress remains an editor favorite. Here’s why\n\nApr 17, 2025\n\n5 minute readmin read](https://www.cnn.com/cnn-underscored/fashion/amazon-nightgown-dresses?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=related.en)\n\n[These 11 editor-favorite spring dresses from Amazon are less than $50\n\nApr 7, 2025\n\n2 minute readmin read](https://www.cnn.com/cnn-underscored/fashion/editors-favorite-amazon-spring-dresses?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=related.en)\n\n[The 11 comfiest travel dresses, according to stylists and editors\n\nMay 7, 2025\n\n3 minute readmin read](https://www.cnn.com/cnn-underscored/fashion/best-travel-dresses?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=related.en)\n\ninfo\n\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\n\n## Most read\n\n[Tropical storm watch issued for North Carolina coast, as Hurricane Erin brings life-threatening rip currents to Outer Banks\n\n6 minute readmin read](https://www.cnn.com/2025/08/18/weather/hurricane-erin-impacts-tracking-atlantic-climate-hnk?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Itsy Bitsy Teenie Weenie: This is the latest celebrity-favorite bikini\n\n4 minute readmin read](https://www.cnn.com/2025/08/18/style/frankies-bikinis-celebrity-cool-girl-brand?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\n[Donbas: The object of Putin’s desire and the crux of the war in Ukraine\n\n3 minute readmin read](https://www.cnn.com/2025/08/18/europe/donbas-the-object-of-putins-desire-and-the-crux-of-the-war-in-ukraine?iid=cnn_buildContentRecirc_end_recirc&recs_exp=most-read-article-end&tenant_id=popular.en)\n\nAd Feedback\n\ninfo\n\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\n\n## More from CNN\n\n[23 best wedding guest dresses from Amazon, according to stylists\n\nMay 1, 2025](https://www.cnn.com/cnn-underscored/fashion/best-wedding-guest-dresses-amazon?iid=cnn_buildContentRecirc_end_recirc&recs_exp=more-from-cnn-right-rail&tenant_id=related.en)\n\n[A viral hit, this $38 Amazon nightgown dress remains an editor favorite. ...\n\nApr 17, 2025](https://www.cnn.com/cnn-underscored/fashion/amazon-nightgown-dresses?iid=cnn_buildContentRecirc_end_recirc&recs_exp=more-from-cnn-right-rail&tenant_id=related.en)\n\n[These 11 editor-favorite spring dresses from Amazon are less ...\n\nApr 7, 2025](https://www.cnn.com/cnn-underscored/fashion/editors-favorite-amazon-spring-dresses?iid=cnn_buildContentRecirc_end_recirc&recs_exp=more-from-cnn-right-rail&tenant_id=related.en)\n\nAd Feedback\n\ninfo\n\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\n\n## News & buzz\n\n[Tropical storm watch issued for North Carolina coast, as ...\n\nAug 18, 2025](https://www.cnn.com/2025/08/18/weather/hurricane-erin-impacts-tracking-atlantic-climate-hnk?iid=cnn_buildContentRecirc_end_recirc&recs_exp=news-%26-buzz-right-rail&tenant_id=popular.en)\n\n[Itsy Bitsy Teenie Weenie: This is the latest celebrity-favorite bikini\n\nAug 18, 2025](https://www.cnn.com/2025/08/18/style/frankies-bikinis-celebrity-cool-girl-brand?iid=cnn_buildContentRecirc_end_recirc&recs_exp=news-%26-buzz-right-rail&tenant_id=popular.en)\n\n[Donbas: The object of Putin’s desire and the crux of the war in Ukraine\n\nAug 18, 2025](https://www.cnn.com/2025/08/18/europe/donbas-the-object-of-putins-desire-and-the-crux-of-the-war-in-ukraine?iid=cnn_buildContentRecirc_end_recirc&recs_exp=news-%26-buzz-right-rail&tenant_id=popular.en)\n\nAd Feedback\n\nAd Feedback\n\n#### Privacy Policy\n\nFor privacy options, please see our privacy policy:  \n<https://www.cnn.com/privacy>.\n\n## Legal Terms and Privacy\n\nBy clicking \"Agree\", you have read and agree to the [Terms of Use](/terms) and agree to the collection and use of your information by cookies and similar technologies, as set forth in our [Privacy Policy](/privacy).\n\n[Agree](#)",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.01,
    "request_id": "1bc7d2db-e250-4a31-94ea-17a445b5789b"
  }
}