{
  "url": "https://www.eventbrite.com/l/eventbrite-app/",
  "timestamp": "2025-08-19T10:14:08.231186",
  "extracted": {
    "results": [
      {
        "url": "https://www.eventbrite.com/l/eventbrite-app/",
        "raw_content": "# New app. New Us.\n\nLet’s GET\n\nINTO IT\n\nWelcome to our second act.\n\n[Get the New App](https://eventbrite.app.link/get-the-app-mlp)\n\nMeet the new Eventbrite App\n\nIt’s everything you want to get into… right in one place. Find more new things to do with a personalized feed and insider guides from our culture curators.   \n  \nBook with confidence thanks to new key event details that let you understand the vibe before booking. Share events with friends, and find out first when they’ve booked.  \n‍  \nWith our new app, it’s easy to get into going out.\n\nFind it.\n\nThere's more new things to do.\n\nDiscover exciting experiences\n\nOur discover tab is now your personalized feed, with custom recommendations and more search and filtering options to inspire your next adventure.\n\nExplore It-Lists: our curated guides\n\nDiscover exciting and unexpected things going on in your city with It-Lists: hand-picked happenings from local culture curators. Launching in select cities but coming to more markets soon.\n\nReady to get into it?\n\n[Get the New App](https://eventbrite.app.link/get-the-app-mlp)\n\nBook it.\n\nCommit with confidence.\n\nHave that good-to-know event info\n\nOur updated event listings provide key details and highlights so you can feel good about locking in your plans.\n\nVibe check before checkout\n\nWith superior photos and videos of locations and events, you’ll get a sense for the scene before buying your tickets.\n\nShare it.\n\nAnd see what everyone’s got going on.\n\nFind and follow friends\n\nSeamlessly import contacts and find your friends, so you can share your finds and always stay looped in on the latest and greatest happenings.\n\nSee who's   \nbooked\n\nLet FOMO be a bygone. See first when friends have booked and never miss a plan you want to be a part of.\n\nGet into It.\n\nEverything you need, right in one place.\n\nAlways have tickets on-hand\n\nHave all your tickets in a dedicated tab, or saved to your phone wallet, so you’re never searching (or printing).\n\nAnd details at your fingertips\n\nAddress, time, parking info—always be prepared with the last-minute info you need.\n\nFour easy\n\nTabs\n\nOur app is organized into four main tabs for a simple-to-navigate experience.\n\nDiscover\n\nRecommended events, culture curated It-Lists, with more filtering options and better visuals so you can find and commit to your next adventure.\n\nSaved\n\nNever lose track of your best-laid plans or It-Lists that caught your eye. Share them from here with friends to make coordinating more fun.\n\nTickets\n\nHave your tickets and all those important last-minute event details right at your fingertips.\n\nAccount\n\nFind and add friends, manage followers, update your profile.\n\nReady to get into it?\n\nDownload the app and start discovering events like never before. Your next adventure is waiting\n\n[Get the New App](https://eventbrite.app.link/get-the-app-mlp)\n\nAre you an Event Organizer?\n\nExplore the new Creator Features.\n\n[Learn more](#)",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.01,
    "request_id": "08e7e857-b64a-4566-9eef-31c80b93bb3d"
  }
}