{
  "url": "https://www.timeout.com/newyork/events-calendar/september-events-calendar",
  "timestamp": "2025-08-18T22:57:49.728779",
  "extracted": {
    "results": [
      {
        "url": "https://www.timeout.com/newyork/events-calendar/september-events-calendar",
        "raw_content": "🙌  \nAwesome, you're subscribed!\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York straight to your inbox\n\nWe help you navigate a myriad of possibilities. Sign up for our newsletter for the best of the city.\n\n![Loading animation](/static/images/loading_icon.gif)\n\nBy entering your email address you agree to our [Terms of Use](https://www.timeout.com/usa/terms-of-use) and [Privacy Policy](https://www.timeout.com/privacy-notice) and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nAwesome, you're subscribed!\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nThe best of New York for free.\n\nSign up for our email to enjoy New York without spending a thing (as well as some options when you’re feeling flush).\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our [Terms of Use](https://www.timeout.com/usa/terms-of-use) and [Privacy Policy](https://www.timeout.com/privacy-notice) and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nAwesome, you're subscribed!\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nLove the mag?\n\nOur newsletter hand-delivers the best bits to your inbox. Sign up to unlock our digital magazines and also receive the latest news, events, offers and partner promotions.\n\nDéjà vu! We already have this email. Try another?\n\nBy entering your email address you agree to our [Terms of Use](https://www.timeout.com/usa/terms-of-use) and [Privacy Policy](https://www.timeout.com/privacy-notice) and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\nNew York\n\nNew York\n\n![NYBG pumpkins](https://media.timeout.com/images/105817970/750/562/image.jpg \"NYBG pumpkins\")\n\n# NYC events in September 2025\n\nThe best NYC events in September range from last-minute summer excursions to San Gennaro celebrations and more.\n\n![Rossilynne Skena Culgan](https://media.timeout.com/images/106210735/170/170/image.jpg)\n\nThe best NYC events in September include everything from last-minute [things to do in summer](https://www.timeout.com/newyork/things-to-do/summer-in-new-york) to early fall celebrations including incredible art and cultural events. Use our events calendar for September to help you schedule all the happenings you don’t want to miss, like the NYC Pizza Run, Pumpkin Nights at the Bronx Zoo, Morningside Lights, and music festivals.\n\nSure, summer is nearly over, but there's still time to enjoy all of the wonderful things to do outside in New York before the cold temps usher in [fall in NYC](https://www.timeout.com/newyork/things-to-do/things-to-do-in-new-york-this-fall) with its colorful leaves, apple cider donuts and jack-o'-lanterns galore.\n\n**RECOMMENDED: Full [NYC events calendar](https://www.timeout.com/newyork/events-calendar) for 2025**\n\nBeen there, done that? Think again, my friend.\n\n![Loading animation](/static/images/loading_icon.gif)\n\nBy entering your email address you agree to our [Terms of Use](https://www.timeout.com/usa/terms-of-use) and [Privacy Policy](https://www.timeout.com/privacy-notice) and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\n🙌  \nAwesome, you're subscribed!\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\n## The best of the city under one roof\n\n### Time Out Market New York\n\n![Time Out Market New York](https://media.timeout.com/images/106170943/750/422/image.jpg \"Time Out Market New York\")\n![Time Out Market New York](https://media.timeout.com/images/106170943/750/562/image.jpg \"Time Out Market New York\")\n\nWe’ve packed all our favorite restaurants under one roof at the [Time Out Market New York](https://www.timeout.com/newyork/time-out-market). The DUMBO location in Empire Stores has fried chicken from Jacob’s Pickles, pizza from Fornino, inventive ice cream flavors from Sugar Hill Creamery and more amazing eateries—all cherry-picked by us. Chow down over two floors with views of the East River, Brooklyn Bridge and Manhattan skyline.\n\n![Loading animation](/static/images/loading_icon.gif)\n\n## Featured NYC events in September 2025\n\n### 1. Labor Day weekend celebrations\n\n![Labor Day weekend celebrations](https://media.timeout.com/images/106285189/750/422/image.jpg \"Labor Day weekend celebrations\")\n![Labor Day weekend celebrations](https://media.timeout.com/images/106285189/750/562/image.jpg \"Labor Day weekend celebrations\")\n\nBefore you bid summer adieu, go out with a bang on Labor Day. Whether you want ideas for cool out-of-town spots or just want a staycation, we’ve listed all the best events and other unmissabale things to do, including ways to have the best summer ever before Labor Day weekend 2025.\n\n### 2. West Indian Day Parade\n\n![West Indian Day Parade](https://media.timeout.com/images/100768581/750/422/image.jpg \"West Indian Day Parade\")\n![West Indian Day Parade](https://media.timeout.com/images/100768581/750/562/image.jpg \"West Indian Day Parade\")\n\nFor some, Labor Day is just another Monday off, but the costumed gods and goddesses of this wild parade spend the whole year hot-gluing feathers and stones to their magnificent outfits. Party all the way down Eastern Parkway and enjoy technicolor floats representing countries like Barbados, Jamaica, and Trinidad and Tobego while you indulge in jerk chicken and other delicacies.\n\nThe annual West Indian Day Parade draws close to two million people to Crown Heights in Brooklyn each year. During the carnival, steel-pan and calypso bands in elaborate costumes march down Eastern Parkway, and vendors sell homestyle island grub along the route.\n\nThe West Indian Day Parade is Monday, September 1, 2025 (Labor Day) [starting at 10am](https://www.instagram.com/p/DL-74E9SuFU/).\n\n### 3. Feast of San Gennaro\n\n![Feast of San Gennaro](https://media.timeout.com/images/105543406/750/422/image.jpg \"Feast of San Gennaro\")\n![Feast of San Gennaro](https://media.timeout.com/images/105543406/750/562/image.jpg \"Feast of San Gennaro\")\n\nWe could all use a big plate of pasta chased with a cannoli right about now. The Feast of San Gennaro is here to meet those needs with its annual festival featuring parades, live music and of course, glorious foods.\n\nFestivities run from September 11-21, 2025 in Little Italy. Activities include the Blessing of the Stands, the Grand Procession Procession, and a Solemn High Mass celebrating the patron Saint of Naples. Here's the [full events calendar](https://sangennaronyc.org/event-calendar/).\n\n### 4. Free Shakespeare in the Park\n\n![Free Shakespeare in the Park](https://media.timeout.com/images/106296506/750/422/image.jpg \"Free Shakespeare in the Park\")\n![Free Shakespeare in the Park](https://media.timeout.com/images/106296506/750/562/image.jpg \"Free Shakespeare in the Park\")\n\nCentral Park's newly renovated Delacorte Theater is back in business for [Shakespeare in the Park's free performances of *Twelfth Night*](https://www.timeout.com/newyork/theater/shakespeare-in-the-park). The renovation focused on improving accessibility and modernizing the space for artists and audiences.\n\nJesse Tyler Ferguson, Peter Dinklage, Lupita Nyong’o, and Sandra Oh will perform in this year's shows, which run through September 14. Tickets are free, but you'll have to wait in line; [here's how to get them](https://www.timeout.com/newyork/theater/shakespeare-tickets-how-to-get-free-tickets-to-the-delacorte).\n\n### 5. September 11 commemorations\n\n![September 11 commemorations](https://media.timeout.com/images/105699306/750/422/image.jpg \"September 11 commemorations\")\n![September 11 commemorations](https://media.timeout.com/images/105699306/750/562/image.jpg \"September 11 commemorations\")\n\nThis year marks the 24 years since the September 11 attacks, and you may be looking for events around NYC to memorialize this solemn day. In 2025, events include vigils, memorials, and tribute runs.\n\n### 6. Van Gogh's Flowers at New York Botanical Garden\n\n![Van Gogh's Flowers at New York Botanical Garden](https://media.timeout.com/images/106277128/750/422/image.jpg \"Van Gogh's Flowers at New York Botanical Garden\")\n![Van Gogh's Flowers at New York Botanical Garden](https://media.timeout.com/images/106277128/750/562/image.jpg \"Van Gogh's Flowers at New York Botanical Garden\")\n\nVincent van Gogh had a knack for making flowers seem to spring to life from his canvases. Now, his lilies, sunflowers, trees and more have truly come to life at New York Botanical Garden's newest exhibit. Titled \"Van Gogh's Flowers,\" the massive exhibition transforms the garden's 250 acres into a kaleidoscopic celebration of the artist's lifelong passion for nature.\n\nThis isn’t just a flower show. The exhibition brings Van Gogh’s expressive canvases off the wall and into the wild, pairing his iconic works with contemporary interpretations and living installations. At the heart of the experience is a towering field of real and sculptural sunflowers designed by French artist Cyril Lancelin, an immersive environment where guests can wander through Van Gogh’s signature motif on a monumental scale. Other installations feature reflecting pools, sculptures and playful programming.\n\nSee it in The Bronx through October 26, 2025.\n\n### 7. All Things Go Music Festival\n\n![All Things Go Music Festival](https://media.timeout.com/images/106259754/750/422/image.jpg \"All Things Go Music Festival\")\n![All Things Go Music Festival](https://media.timeout.com/images/106259754/750/562/image.jpg \"All Things Go Music Festival\")\n\nSince its humble beginnings at D.C.’s Union Market, All Things Go Music Festival has become one of the most anticipated events of late New York City summers. With lineups that predominantly feature queer artists, the event stands sturdy in its values. This year, the festival will return to Forest Hills Stadium and will take place from September 26 through September 28. See artists like Lucy Dacus, DJO, DOECHII, Remi Wolf, Clairo and The Marias, among many others.\n\nTickets start at $89 for [general admission](https://allthingsgofestival.com/nyc/).\n\n### 8. Brooklyn Book Festival\n\n![Brooklyn Book Festival](https://media.timeout.com/images/106302878/750/422/image.jpg \"Brooklyn Book Festival\")\n![Brooklyn Book Festival](https://media.timeout.com/images/106302878/750/562/image.jpg \"Brooklyn Book Festival\")\n\nAs New York City's largest free literary festival, this annual celebration brings together hundreds of spectacular writers from across the globe for more than a week of talks and shopping to satisfy the borough's brainiacs. The festival is celebrating its 20th anniversary this year.\n\nActivities run September 14-22 with writers in a variety of genres: international and local, for adult and young readers, working in fiction and nonfiction, poetry, prose, and graphic storytelling. Events are free, but you’ll definitely want to bring some money to buy some new books to take home.\n\nWhile activities run for the entirety of the nine-day celebration, the centerpiece festival day on Sunday, September 21, takes place in the parks and plazas surrounding Downtown Brooklyn’s Borough Hall and other venues. Multiple stages will overflow with conversation as authors come together to converse, read and sign books throughout the day. Festival Day also stages the largest book market in the Northeast with more than 250 publishers, offering readers the possibility to discover new authors, independent publishers and literary organizations.\n\nHere's the [full schedule](https://brooklynbookfestival.org/).\n\n### 9. The Great Jack O’Lantern Blaze\n\n![The Great Jack O’Lantern Blaze](https://media.timeout.com/images/106167402/750/422/image.jpg \"The Great Jack O’Lantern Blaze\")\n![The Great Jack O’Lantern Blaze](https://media.timeout.com/images/106167402/750/562/image.jpg \"The Great Jack O’Lantern Blaze\")\n\nCarving a jack-o'-lantern may be a time-honored American tradition for many, but nobody—and we mean nobody—does pumpkin carving quite like Great Jack O’Lantern Blaze.\n\nEvery fall, pumpkins aplenty decorate this festive, family-friendly attraction. This year promises thousands of intricately carved jack-o'-lanterns in mesmerizing displays, plus dazzling new experiences.\n\nBlaze: Hudson Valley runs at Van Cortlandt Manor in Croton-on-Hudson in Westchester County from September 12 through November 16. [Get tickets here](https://www.pumpkinblaze.org/).\n\n### 10. New York Yankees\n\n![New York Yankees](https://media.timeout.com/images/103512352/750/422/image.jpg \"New York Yankees\")\n![New York Yankees](https://media.timeout.com/images/103512352/750/562/image.jpg \"New York Yankees\")\n\nHitting a Yankees game couldn’t be more quintessentially New York. The Major League Baseball team, which won the World Series in 1978, 1996, 1998, 1999, 2000 and 2009, made it to the World Series again in 2024! To date, the Yankees have won 27 World Series in 42 appearances, the most in the MLB in addition to major North American professional sports leagues. Through 2024, their all-time regular season winning percentage is .569 (a 10,778 – 8,148 record)—the best of any team in MLB history.\n\nGrab your tickets now to see NYC in action!\n\n### 11. Punderdome\n\n![Punderdome](https://media.timeout.com/images/100122357/750/422/image.jpg \"Punderdome\")\n![Punderdome](https://media.timeout.com/images/100122357/750/562/image.jpg \"Punderdome\")\n\nThe pun, that most democratic of jokes: At its best, it’s sublimely satisfying to the reptilian part of our brains that loves easy comedy. At its worst, it produces a groan so gut-deep, it’s almost as good as a belly laugh. The form is mined for all it’s worth at this monthly tournament, hosted by Rodney Dangerfield impersonator Fred Firestone and his daughter, Jo.\n\nA fixture on the NYC comedy landscape for more than a decade, this show at Littlefield in Brooklyn is like a rap battle, only much nerdier. Hear pun pros face-off in the All-Star Tournament of Pun Champions where punsters deliver two-minute pun-stand-up routines, after only two minutes of preparation.\n\nHere's the lineup of 2025 shows: September 3 and October 29.\n\n### 12. CBGB Festival\n\n![CBGB Festival](https://media.timeout.com/images/103503756/750/422/image.jpg \"CBGB Festival\")\n![CBGB Festival](https://media.timeout.com/images/103503756/750/562/image.jpg \"CBGB Festival\")\n\nA dearly departed piece of New York’s punk past is being resurrected for one night only this fall. [CBGB](https://www.timeout.com/newyork/news/nycs-legendary-cbgb-still-leaves-a-powerful-legacy-50-years-later-122023)—the iconic East Village music club that helped kickstart the careers of many notable punk rock and new wave bands, including Ramones, Blondie, Television, Talking Heads, Dead Boys and Patti Smith Group, among others—will be popping up once again as CBGB Festival on September 27 at Under the K Bridge Park in Greenpoint, Brooklyn. (The original CBGB shuttered for good in 2006 at 315 Bowery.)\n\nThe lineup features 21 bands, including Iggy Pop, Jack White, The Sex Pistols, Johnny Marr, Lunachicks, Marky Ramone, The Damned, Melvins, The Linda Lindas, Destroy Boys, Angel Du$t, Scowl, Pinkshift, Teen Mortgage, YHWH Nailgun and Lip Critic.\n\nTickets cost between $73-$149 at [CBGBFEST.COM](https://cbgbfest.com/)\n\n### 13. Secrets of Lower Manhattan walking tour\n\n![Secrets of Lower Manhattan walking tour](https://media.timeout.com/images/106282322/750/422/image.jpg \"Secrets of Lower Manhattan walking tour\")\n![Secrets of Lower Manhattan walking tour](https://media.timeout.com/images/106282322/750/562/image.jpg \"Secrets of Lower Manhattan walking tour\")\n\nOn this in-person walking tour, dig into the secrets of Lower Manhattan: a treasure trove of mysteries, obscurities, and hidden history waiting to be unearthed. Discover the lesser-known backstory, hidden gems, and untold secrets of this neighborhood. Whether you're an NYC local or a visitor, you'll learn lots about the city's time under Dutch rule, revolutionary history, and incredible works of art. Without ever leaving Manhattan, this tour will transport you to Ireland, Germany, and the Netherlands.\n\nTime Out's very own Things to Do Editor Rossilynne Culgan will serve as your guide. Your $35 ticket includes the 90-minute walking tour and a signed copy of Culgan's book \"[Secret New York City: A Guide to the Weird, Wonderful, and Obscure](https://www.secretnewyorkcitybook.com/).\" Books can be personalized upon request.\n\n[Register here](https://www.eventbrite.com/e/secrets-of-lower-manhattan-walking-tour-tickets-1344801630879?aff=oddtdtcreator) for the final tour of the season on Saturday, September 6.\n\n### 14. \"The New York Sari\" exhibit\n\n![\"The New York Sari\" exhibit](https://media.timeout.com/images/106297347/750/422/image.jpg \"\\\"The New York Sari\\\" exhibit\")\n![\"The New York Sari\" exhibit](https://media.timeout.com/images/106297347/750/562/image.jpg \"\\\"The New York Sari\\\" exhibit\")\n\nMost people associate the sari with its South Asian origin. IN a new exhibit, the New York Historical adds another layer to the garment's story by unearthing how the sari—and those who wear it—made New York City a home. \"[The New York Sari: A Journey Through Tradition, Fashion, and Identity](https://www.nyhistory.org/press/the-new-york-historical-presents-the-new-york-sari)\" opens September 12 and runs through April 2026.\n\nThis exhibition traces the path of the sari from the Indian subcontinent to NYC, going from exotic object of trade to a tradition embraced by many communities. The sari holds many different identities; whether it be within consumer empires, dance and performance or explorations of gender and identity, museum officials explained.\n\n### 15. JAPAN Fes\n\n![JAPAN Fes](https://media.timeout.com/images/106243821/750/422/image.jpg \"JAPAN Fes\")\n![JAPAN Fes](https://media.timeout.com/images/106243821/750/562/image.jpg \"JAPAN Fes\")\n\nForget the 14-hour flight from NYC to Tokyo, you can now discover the tastes of Japan with just a short subway ride to JAPAN Fes. The massive annual food festival just announced its 2025 dates, and the schedule is packed with events.\n\nThe organization is hosting nearly 30 outdoor events in NYC this year. What used to be just a summertime festival is now a year-round celebration across Manhattan, Brooklyn and Queens. Event organizers say it's the largest Japanese food festival in the world, attracting 300,000 visitors and featuring 1,000 vendors every year.\n\nHere's the lineup for September: September 6 on the Upper East Side; September 13 in Chelsea; September 20 on the Upper West Side.\n\n### 16. U.S. Open\n\n![U.S. Open](https://media.timeout.com/images/105678894/750/422/image.jpg \"U.S. Open\")\n![U.S. Open](https://media.timeout.com/images/105678894/750/562/image.jpg \"U.S. Open\")\n\nThe U.S. Open—New York’s exhilarating summer sports event—is one of the most exciting things to do in Queens. It returns this month with plenty of exciting activities for fans. The main draw runs from August 24–September 7.\n\nTickets to the U.S. Open are now on sale [here](https://fave.co/3IAMKkv).\n\n### 17. Catacombs by Candlelight Tour\n\n![Catacombs by Candlelight Tour](https://media.timeout.com/images/103949328/750/422/image.jpg \"Catacombs by Candlelight Tour\")\n![Catacombs by Candlelight Tour](https://media.timeout.com/images/103949328/750/562/image.jpg \"Catacombs by Candlelight Tour\")\n\nThis fascinating 80-minute tour introduces you to all the secrets of the two-centuries-old Basilica of St. Patrick’s Old Cathedral. Enter areas off-limits to the public, including cemeteries and the Henry Erban Organ. Top it all off with an exclusive walk-through of the Catacombs themselves.\n\nEven better, you will experience the whole tour by candlelight (romantic—you know, if you ignore the dead bodies part). This unique and historic site serves as the final resting place for many prominent New Yorkers, including the Delmonico Family, General Thomas Eckert (a confidant of Abraham Lincoln), Honest John Kelly of Tammany Hall, and the first resident Bishop of New York, Bishop John Connolly.\n\n### 18. Global Citizen Festival concert\n\n![Global Citizen Festival concert](https://media.timeout.com/images/106278041/750/422/image.jpg \"Global Citizen Festival concert\")\n![Global Citizen Festival concert](https://media.timeout.com/images/106278041/750/562/image.jpg \"Global Citizen Festival concert\")\n\nThe show is on Saturday, September 27. An annual NYC event since 2012, Global Citizen Festival effectively turns the Great Lawn into a massive open-air concert as a reward for doing good in the community.\n\n### 19. Le Dîner en Blanc\n\n![Le Dîner en Blanc](https://media.timeout.com/images/106300405/750/422/image.jpg \"Le Dîner en Blanc\")\n![Le Dîner en Blanc](https://media.timeout.com/images/106300405/750/562/image.jpg \"Le Dîner en Blanc\")\n\nThe all-white affair that is [Le Dîner en Blanc](https://newyork.dinerenblanc.com/city) is returning to NYC this fall, landing in an undisclosed location on September 19. Billed as the “World’s Largest Dinner Party,” the roaming event gathers 100,000 people around the globe, all clad in white, to celebrate an evening of gathering, food and revelry under the stars.\n\nThis year, lucky New Yorkers attending the French-inspired picnic will be joined by an authority of the cuisine itself: the one and only Daniel Boulud. The acclaimed chef, restaurateur and cookbook author will be curating picnic baskets for the exclusive evening. While reserving the food is not a requirement, the inclusion of the picnic baskets may just help lighten your load.\n\nMake [an account on the event's website](https://dinerenblanc.com/) so you can be notified when tickets go on sale and reserve one of Boulud's baskets for yourself.\n\n### 20. Smorgasburg\n\n![Smorgasburg](https://media.timeout.com/images/106113185/750/422/image.jpg \"Smorgasburg\")\n![Smorgasburg](https://media.timeout.com/images/106113185/750/562/image.jpg \"Smorgasburg\")\n\n[Smorgasburg](https://www.smorgasburg.com/), the food bazaar spectacular, is back with dozens of great local vendors across three locations. Smorgasburg WTC runs on Fridays; Williamsburg is on Saturdays; and Prospect Park is on Sundays. Each location is open weekly through October. \n\nFor its 15th year of outdoor food and fun, Smorgasburg will showcase more than 70 vendors. The food festival will be filled with fragrant Ethiopian stews, Hawaii-style street comforts, explosive pani puri, potato puff poutine and lots more.\n\n### 21. Arte Museum\n\n![Arte Museum](https://media.timeout.com/images/106300397/750/422/image.jpg \"Arte Museum\")\n![Arte Museum](https://media.timeout.com/images/106300397/750/562/image.jpg \"Arte Museum\")\n\nLose yourself in immersive digital art, evocative soundscapes and custom-crafted scents at the new Arte Museum. The museum promises \"a multi-sensory journey beyond time and space\" with dazzling installations inspired by the beauty of nature. The experience is heightened by soundscapes from acclaimed composer Young-gyu Jang and custom-crafted fragrances by master perfumer Marianne Nawrocki Sabatier.\n\nAfter the experience, you can unwind at Arte Cafe, offering fusions of tea as well as media art. From beginning to end, it's packed with Instagrammable moments.\n\nExpect to spend about an hour-and-a-half at this experience at 61 Chelsea Piers this fall.\n\n### 22. Yoga in Bryant Park\n\n![Yoga in Bryant Park](https://media.timeout.com/images/106275183/750/422/image.jpg \"Yoga in Bryant Park\")\n![Yoga in Bryant Park](https://media.timeout.com/images/106275183/750/562/image.jpg \"Yoga in Bryant Park\")\n\nNew York’s ultimate open-air [yoga studio](https://www.timeout.com/newyork/things-to-do/yoga-in-nyc) is back. [Bryant Park](https://www.timeout.com/newyork/attractions/bryant-park) just announced the return of its wildly popular free yoga series, with sessions running through September 17. Now in its 22nd year, the beloved al fresco fitness tradition has grown from a few mats on the lawn to one of the city’s largest and most consistent community workout programs, often drawing more than 1,000 yogis per class. Led by over 30 of the region’s top instructors, each session offers a fresh flow, welcoming all skill levels and ages.\n\nClasses take place twice a week: Tuesdays at 10am on the Upper Terrace and Wednesdays at 6pm on the Lawn. Registration is required (and spots go fast), so snag yours early and don't forget to BYO mat and water. Mats are *not* provided, and trust us, you don’t want to be the one practicing on bare concrete while your neighbor nails a headstand.\n\n### 23. Life Chronicles: An immersive VR journey\n\n![Life Chronicles: An immersive VR journey](https://media.timeout.com/images/106300381/750/422/image.jpg \"Life Chronicles: An immersive VR journey\")\n![Life Chronicles: An immersive VR journey](https://media.timeout.com/images/106300381/750/562/image.jpg \"Life Chronicles: An immersive VR journey\")\n\nUh, how did we get here? If you've ever pondered that question, this immersive VR journey called Life Chronicles is worth your time. The experience will take you on a journey through Earth's history, from the origins of life 3.5 billion years ago to the rise of humans.\n\nDuring the adventure, get up close to iconic creatures like the Tyrannosaurus, Cambrian marine life, Cretaceous dinosaurs—and even early humans. As the story unfolds, you'll witness evolutionary milestones of each great geological period.\n\nThe show isn't just fun, it's also scientifically accurate. Life Chronicles was creatd by Excurio in collaboration with experts from the Muséum national d'Histoire naturelle of Paris, so you know you can believe what you see. It's virtual reality—and actual reality, too. See it at Eclipso, located at 555 West 57th Street.\n\n**RECOMMENDED: [I stepped back into ancient Egypt at this fascinating virtual reality experience in NYC](https://www.timeout.com/newyork/news/i-stepped-back-into-ancient-egypt-at-this-fascinating-virtual-reality-experience-in-nyc-021225)**\n\n### 24. Oktoberfest\n\n![Oktoberfest](https://media.timeout.com/images/100525173/750/422/image.jpg \"Oktoberfest\")\n![Oktoberfest](https://media.timeout.com/images/100525173/750/562/image.jpg \"Oktoberfest\")\n\nOne of the top things to do in New York this fall includes two weeks of drinking some of the best beer in NYC during Oktoberfest. Take in the beautiful fall foliage while drinking at one of the best beer gardens and German eateries in New York City. Oktoberfest New Yorkers, take advantage of this glorious holiday to sample fine Bavarian beer and food. Prost!\n\n### 25. Archery at Wild Captives\n\n![Archery at Wild Captives](https://media.timeout.com/images/106028865/750/422/image.jpg \"Archery at Wild Captives\")\n![Archery at Wild Captives](https://media.timeout.com/images/106028865/750/562/image.jpg \"Archery at Wild Captives\")\n\n[Wild Captives](https://wildcaptives.com/), the nation’s first female- and LGBTQ-owned archery studio, is now open. It's a place where everyone can \"be their own superhero.\" The studio in Brooklyn’s Industry City offers empowering and fun hour-long introduction to archery classes every weekend for $45/person.\n\nEach intro class includes a chance to learn about different parts of the bow and safety requirements. After the lesson, each participant gets a chance to shoot the bow trying to pop a balloon pinned onto the bullseye. Intro-to-archery classes are available each Friday, Saturday and Sunday, [bookable online](https://wildcaptives.com/products/archery-class) for anyone over age 12.\n\n![Loading animation](/static/images/loading_icon.gif)\n\nBeen there, done that? Think again, my friend.\n\n![Loading animation](/static/images/loading_icon.gif)\n\nBy entering your email address you agree to our [Terms of Use](https://www.timeout.com/usa/terms-of-use) and [Privacy Policy](https://www.timeout.com/privacy-notice) and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\n🙌  \nAwesome, you're subscribed!\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nBeen there, done that? Think again, my friend.\n\n![Loading animation](/static/images/loading_icon.gif)\n\nBy entering your email address you agree to our [Terms of Use](https://www.timeout.com/usa/terms-of-use) and [Privacy Policy](https://www.timeout.com/privacy-notice) and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\n🙌  \nAwesome, you're subscribed!\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nPopular on Time Out\n\n[category]\n\n[title]\n\nDiscover Time Out original video\n\n![Loading animation](/static/images/loading_icon.gif)\n\nBy entering your email address you agree to our [Terms of Use](https://www.timeout.com/usa/terms-of-use) and [Privacy Policy](https://www.timeout.com/privacy-notice) and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\n🙌 Awesome, you're subscribed!\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\nGet us in your inbox\n\n![Loading animation](/static/images/loading_icon.gif)\n\nBy entering your email address you agree to our [Terms of Use](https://www.timeout.com/usa/terms-of-use) and [Privacy Policy](https://www.timeout.com/privacy-notice) and consent to receive emails from Time Out about news, events, offers and partner promotions.\n\n🙌 Awesome, you're subscribed!\n\nThanks for subscribing! Look out for your first newsletter in your inbox soon!\n\n[About us](https://www.timeout.com/about)\n\n[Contact us](https://www.timeout.com/about/contact-us)\n\nTime Out products",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.41,
    "request_id": "7fa2a382-fb8e-4001-b3c5-1ad2b0b514a0"
  }
}