{
  "url": "https://unfoundation.org/unga80/",
  "timestamp": "2025-08-18T22:57:48.789573",
  "extracted": {
    "results": [
      {
        "url": "https://unfoundation.org/unga80/",
        "raw_content": "We value your privacy\n\nWe use cookies to make this site work. With your consent, we use additional cookies to enhance your experience. Cookies may collect information about you, your preferences, or your device.\n\nTo consent, click “Accept All.” To change your preferences, click “Manage Cookies.”\n\nFor more information, read our [Privacy Policy](https://unfoundation.org/privacy-policy/)\n\n\n\n\n# United Nations General Assembly\n\n## SEPTEMBER 9 – 28, 2025\n\nThe 80th session of the UN General Assembly (UNGA) opens on September 9, 2025. Two weeks later, High-Level General Debate kicks off Tuesday, September 23, 2025.\n\nAs the United Nations marks its 80th year, global leaders will convene in New York City to build consensus and confront complex global challenges. Eight decades after its establishment, the UN remains the only place on Earth where countries can gather to work through their differences and find common ground — shaping our shared future.\n\nExplore this page for updates on events and expert commentary on UNGA 80.\n\n## Related Events\n\n#### Global Goals Week\n\n**September 19-28, 2025**  \nGlobal Goals Week is back this year with more than 170 supporters — across civil society, business, academia, and the UN system — who are ready to push for progress on the SDGs. With just five years to go until the 2030 deadline, Global Goals Week supporters will bring renewed urgency to the call to deliver on the Goals’ universal promise to leave no one behind.\n\n[Learn More](https://globalgoalsweek.org/)\n\n#### Climate Week NYC\n\n**September 21-28, 2025**  \nHeld annually alongside the UN General Assembly, Climate Week NYC brings together leaders from across government, business, tech, academia, and civil society for hundreds of events, activations, campaigns, and critical discussions on the imperative and potential of climate action.\n\n[Learn More](https://www.climateweeknyc.org/about-us )\n\n[View More UNGA 80 Events](https://unfoundation.org/events/upcoming/category/unga/)\n\n## News and Resources\n\nCheck out the latest news and resources to help you prepare for the 2025 UN General Assembly:\n\n* [The United Nations at 80: Building our future together](https://www.un.org/en/UN80)\n* [General Assembly of the United Nations](https://www.un.org/en/ga/)\n\nStay Informed\n\n\nGet the latest on global issues, analysis from our experts, and updates on events hosted by UN Foundation and our partners.\n\n### Share on Mastodon",
        "images": []
      }
    ],
    "failed_results": [],
    "response_time": 0.01,
    "request_id": "a0fed32d-0963-4775-8742-4c203ce97f01"
  }
}